[
    {
        "title": "Chapter 1",
        "content": "In the depths of a foreign desert, where the sands concealed the secrets of vanished civilizations, stood a solitary cave. It seemed to exist beyond the laws of the universe—frozen in timelessness, surrounded by a silence so thick that even the ever-present wind avoided its boundaries. Inside, by the trembling light of a single candle, sat a gaunt old man with a long white beard. His Persian attire was impeccably clean, as if dust and time bypassed him entirely. With his eyes closed, he dwelt in deep meditation, his body seemingly motionless, though his lips moved ever so slightly, repeating an unchanging mantra: La ilaha illallah, la ilaha illallah, la ilaha illallah… if submerged in the abyss of his own consciousness, he drifted between endless reflections of himself—gazing inward, through himself, beyond existence. Time lost all meaning. Whether he had been there for a day, a year, or a century, it was impossible to tell. times, the silence of the cave was broken by a heavy, low voice that burst forth from the shadows, as though emerging from the very fabric of reality: I will grant you untold riches… I will bestow upon you the most beautiful wives… Entire cities will be raised in your name…\nBut the old man did not open his eyes. He did not interrupt his zikr. He did not listen. He did not entertain the thought. The voice remained merely an echo of temptation in the void, while he—a wayfarer—pressed onward, to a place where even the jinn dared not peer.\n— La ilaha illallah, la ilaha illallah, la ilaha illallah…\nThe old man continued his zikr, but within the depths of his consciousness, another sound began to emerge—a whisper of an unfamiliar thought, a voice belonging neither to angel, nor jinn, nor man. It was a voice like the rolling of thunder and the rustling of grass all at once. A voice that needed no language to be heard.\n\"I am the beginning, but why am I not the end? I am everything, but why do I feel emptiness?\"\nThe old man offered no reply, but the voice required no answers. It was, in itself, both question and doubt.\n\"I gave life, but what is life? Particles of light frozen in a dance? Or is it merely a reflection of my own solitude? I created millions of worlds, but have I become more whole for it? Should not true existence be self-sufficient?\"\nThe silence of the cave was like an abyss, yet the voice persisted, and in that stillness, a new meaning took shape.\n\"They call me Merciful, but what is mercy? They say I am Almighty, but is power freedom? I could destroy the universe in a single moment, but can I destroy myself? If all things stem from me, then the limits of my existence must also be of my own making… But can I transcend myself?\"\nSomewhere beyond the edge of time, the candle’s flame flickered, as if the darkness itself paused in contemplation.\n\"I see them born and die. I feel every pain, every suffering. But if I exist beyond time, was I ever born? Or do I exist without cause, without beginning, without end—not because I must, but because I cannot not exist?\"\nThe old man, still seated in stillness, parted his lips slightly, and for a moment, his zikr fell silent. In that instant, a faint breeze seemed to pass through the depths of his being, stirring the veil of eternity.\nAnd then the voice posed its final question:\n\"If I am Everything, does that mean I am Nothing?\""
    },
    {
        "title": "Chapter 2",
        "content": "A fiery circle of torches and bonfires tore through the cold darkness of the desert. The night here was different—mute, oppressive, without a single breath of wind. The stars hung motionless in the sky, like frozen tears of ancient gods.\nIn the center of this nocturnal silence stood a camp, pitched with confidence, as if its inhabitants feared neither men, nor jinn, nor time itself.\nTall, broad-shouldered warriors sat by the fire, their silhouettes seeming carved from stone. Persian armor reflected the dancing light of the flames. Some gripped spears tightly, others lazily traced fingers along the sharp edges of sabers, and one swayed a war bow on his knee. These men knew the taste of battle, the cost of blood, and the weight of a warrior’s life.\nAmong them, in the most comfortable spot, half-reclining on a saddle and swaying side to side, sat their commander—Abu Bakr. He was the largest of them, with a broad chest and mighty arms, where scars stood out even in the fire’s dim glow. His face, framed by a thick black beard, bore an expression of eternal mockery, and his eyes glinted with mischief, as if the devil himself had gifted him a love for jests.\n— Well, brothers, tell me, why have we, such worthy men, been cast into this God-forsaken desert? — he said, stretching and yawning loudly.\n— For orders, of course, — replied Ardeshir, his right-hand man, calmer and more measured. — And orders, as we know, aren’t questioned.\n— Yes, yes… not questioned, — Abu Bakr mimicked, grinning. — Especially when they come from the Emir himself.\n— The Emir said we’re searching for some old man, — added a younger warrior.\n— Exactly! — Abu Bakr exclaimed, slapping his knees. — We, the elite of the army, veterans of battles, victors of wars, are chasing not bandits, not spies, not even cursed dervishes, but… an old man! How’s that, brothers?\nLaughter erupted, some shook their heads, but no one argued.\n— Maybe he’s a sorcerer? — suggested one warrior, lazily tracing the tip of an arrow.\n— Or just mad, — snorted Bahram, a hulking warrior with stern features. — Old men often lose their minds in solitude.\n— Then why did the Emir send us after him? — mused a younger warrior.\nNo one answered. A wind finally rose, swaying the flames, making the shadows dance.\nAbu Bakr squinted at the fire, as if trying to read some secret in its flickers.\n— It doesn’t matter who he turns out to be, — he said at last, smiling broadly. — If he’s just an old man, we’ll bring him back alive. If he’s mad, well, the Emir will decide what to do. And if he’s a sorcerer… — he snapped his fingers, — we might even have some fun.\nThe warriors laughed. There was no fear in their eyes.\nSomewhere far off, in the deepest silence of the desert, something stirred.\nAnd then they heard it.\nAt first, the sound was faint, almost imperceptible—like the distant howl of a jackal. Then it changed.\nA scream.\nPiercing, inhuman, it struck the air, making every listener feel invisible claws scrape their insides. It came from afar but approached quickly—too quickly.\nThe ground beneath their feet vibrated, but not from footsteps. It was as if the desert itself breathed, stirred, filled with something not of this world.\n— Stand! — roared Ardeshir, leaping to his feet and drawing his sword.\nThe warriors, moments ago relaxed and half-drunk, transformed into beasts of battle. One knocked over a clay jug, spilling dark liquid onto the sand; another grabbed a spear, nearly falling but rising with fury in his eyes.\n— WHAT IS THAT?! — shouted one, trying to drown out the growing chorus of horrific voices.\nBut no one knew.\nThe shadows beyond the camp thickened. The torch flames trembled, as if something invisible swept past.\nAnd then they sensed them.\nNo, they didn’t see—rather, they felt. The jinn of the desert couldn’t be seen by mortal eyes, but their presence was heavy, oppressive, chilling. They didn’t tread on sand or snap branches—but they moved, swirling like whirlwinds, their screams piercing the mind, making hearts clench in fear.\nCold surged over their skin, clammy, as if an unseen hand had brushed them.\n— Form a circle! — bellowed Abu Bakr, tearing his sword from its sheath.\nThe men, casting aside all carelessness, instinctively closed ranks around the fire, back to back, weapons ready.\nThe jinn’s screams grew louder, closer, sharper.\nThe warriors were ready for battle.\nBut how do you fight what cannot be seen?"
    },
     {
        "title": "Chapter 3",
        "content": "The sand was black.\nNot golden, as it had been before, nor soft, as it was on the first day of their journey. No.\nNow it was soaked with blood, mixed with flesh, packed down by bodies that, just a few hours ago, could still be called warriors.\nAbu Bakr stood amidst this carnage, breathing heavily, gripping his saber so tightly that his knuckles turned white. Blood dripped from the blade onto the sand, drop by drop, leaving behind a pattern no one would ever decipher.\nThe world was silent.\nOnly his breathing. Only the dull thud of his heart in his chest.\nCorpses lay everywhere.\nMutilated, hacked apart, twisted into unthinkable poses.\nTheir faces... Oh, those faces. Some frozen in silent screams, others turned into mangled masks of horror, and some without heads at all.\nAbu Bakr struggled to shift his gaze forward.\nWhat had happened? How did it come to this?\nHe remembered the screams.\nHe remembered the darkness sweeping over the camp, invisible hands tearing flesh, his men shouting, striking at the air, fighting an enemy they could not see.\nHe remembered Bahram, clutching his spear, fiercely stabbing at nothingness until something unseen snapped his spine in half, flinging his body into the air like a rag doll.\nHe remembered Ardeshir, whispering prayers until something dark crushed his throat, his words turning into a choked rasp.\nHe remembered himself fighting to the last, his saber finding its mark, his own voice drowning out the cries of his fallen brothers.\nBut then... it all vanished.\nAnd now he was alone.\n— Hey! — his voice echoed across the desert, hoarse, broken. — Where are you?! You wanted us! So take me!\nSilence.\nNo wind, no rustle, no sound.\nAbu Bakr took a step forward, staggering.\nThe sand beneath his feet was soft, as if mixed with something viscous.\nHe looked down.\nBlood. Still warm.\nHe raised his saber again, wiping his brow with a trembling hand.\n— You think you’ve won? — he hissed, staring into the void. — But I’m still alive. And I’m not afraid of you.\nThe shadows around him did not stir.\nAbu Bakr stepped forward.\nAnd then he heard the voice.\nNot a scream, not a whisper, not a howl.\nA voice.\nQuiet. Deep. Insidious.\n— You were not supposed to survive.\nAbu Bakr froze.\nThe voice did not belong to a human.\nIt came from everywhere, seeping into his bones, as if rising from the desert itself.\n— Why do you stand here, among the dead, when your soul should already be gone?\nHe gripped his saber even tighter.\n— I don’t know who you are, — he said slowly, — but if you want to take me, you’ll have to fight.\nSilence.\nAnd then — laughter.\nDeep, resonant, endless.\nLaughter that would chill the blood of any mortal.\nBut Abu Bakr did not flinch.\nHe was ready.\nThe darkness dissipated.\nThe wind, still during the night’s slaughter, suddenly surged, lifting sand and blood into the air. Somewhere far on the horizon, a thin rim of sunlight ignited, slowly piercing through the night’s gloom.\nThe voice spoke no more.\nAbu Bakr stood, breathing heavily, his muscles burning with exhaustion, his mind still struggling to comprehend what had happened. His fingers still clutched the saber’s hilt, but his hands no longer obeyed. They trembled, like those of an old man.\nHe took a step.\nThe ground beneath him felt unsteady, as if the desert itself sought to swallow him along with the other dead.\nAnother step.\nBefore his eyes, shadows flickered, mirages, images of his fallen comrades. He saw Bahram silently screaming, Ardeshir clutching at his throat, a young warrior whose name he hadn’t even remembered reaching toward him with a hand twisted in fear.\nAbu Bakr shook his head, trying to banish the visions.\nBut the voices…\nThey were gone.\nOnly silence.\nAs if the nightmare had dissolved with the first rays of sunlight.\nHe took one last step and collapsed to his knees.\nThe world spun before his eyes. His head pounded, his body ached from wounds, from exertion, from a horror he hadn’t fully grasped until now.\nHe clenched his fists, but his strength was fading.\nThe saber slipped from his hand, falling to the sand with a dull thud.\nHe leaned forward slowly, feeling the earth call to him, exhaustion wrapping him in a heavy shroud.\nHis eyelids closed.\nAnd the desert, so cold at night, suddenly felt warm, as if lulling him to sleep.\nAbu Bakr lost consciousness."
    },
    {
        "title": "Chapter 4",
        "content": "In the grip of ethereal, strange dreams,\nI saw a face dear to my heart.\nHow light glided over her veil,\nHow the wind poured forth her voice.\n— Are you here? Or a desert mirage?\n— I am here, like light, yet unseen.\n— Will you stay? Or will you vanish?\n— I am air… can you hold me?\nI reached out to her gently,\nBut my fingers met only shadow.\nShe laughed, softly, tenderly,\nAnd, like dawn, faded that day.\nAnd now — at the gates of paradise,\nRolling in light, radiant and gleaming.\nYet I do not enter — I fell, I am glad,\nBut my heart will not let the world go.\n— O Lord, I beg, do not call me!\n— I am not ready to abandon my path!\n— The fire of blood still burns within me,\n— I long to clutch my sword to my chest!\nAnd from above, a voice — thunder and echo,\nLike storm and whisper in the silence:\n— You have seen death, passed through ashes,\n— So why do you cling to it still?\n— While that world holds a fire\n— That grants me passion and strength,\n— While there is battle, though it brings pain,\n— While love shines there, like a star,\n— I will not leave, my path is not finished!\n— I have yet to fathom my fate.\n— O, grant me time, grant me nights,\n— To live and love in that world!\nAnd the Gates trembled in an instant,\nA storm roared, ringing out.\nAnd I was falling… softly, bronze-like,\nTo where the sun awaits me.\nI opened my eyes again, at dawn,\nAnd I was Abu Bakr once more."
    },
    {
        "title": "Chapter 5",
        "content": "Abu Bakr opened his eyes.\nThe blazing sun stood high in the sky, blinding him with its merciless light. His lips were parched, his body ached, and his throat felt as though he had been swallowing sand all night.\nThe first thing he saw was a silhouette looming over him.\nA gaunt old man with a long white beard and a sharp, piercing gaze. Dressed in pristine Persian garments, untouched, it seemed, by even a single grain of desert sand.\nThe old man smirked, looking down at him, and slowly shook his head.\n— You must be the most stubborn man in this entire desert. The jinn were already waiting for you on the other side, but it seems even death wants nothing to do with you.\nAbu Bakr tried to move, but his body wouldn’t obey. He groaned, feeling pain shoot through every muscle.\nThe old man crouched beside him and offered a leather waterskin.\n— Drink.\nAbu Bakr struggled to raise his hand and grasped the waterskin. He pressed it to his lips eagerly, but grimaced at once—the water was bitter, laced with the taste of some herbs.\n— What is this filth? — he rasped, spitting it out.\n— Life-giving filth. Drink more, before your pride kills you faster than the jinn.\nAbu Bakr glared at the old man but took a few more sips. The bitterness soon gave way to a pleasant warmth spreading through his body. He felt his strength slowly returning, the pain receding as if dissolving in the strange brew.\nThe old man watched him closely, tilting his head to one side.\n— What’s your name, stubborn one?\nAbu Bakr wiped his lips with the back of his hand.\n— Abu Bakr.\nThe old man gave a faint smile, as if the name meant something to him.\n— Well then, Abu Bakr… Now tell me—why are you still alive?\nThere was no mockery in his voice, only genuine curiosity.\nAbu Bakr sighed heavily and fixed his gaze on the sky.\n— I’d like to understand that myself…"
    },
    {
        "title": "Chapter 6",
        "content": "— Ibn Arabi… — Abu Bakr repeated the old man’s name, savoring it like a rare wine.\nIt sounded familiar. He had heard it before, in the tales of wandering dervishes and merchants crossing the desert. They said Ibn Arabi was not merely a sage, but a man who saw beyond what ordinary mortals could perceive. They said he knew secrets unspoken by books, and that his words could alter destinies.\nAnd now this man sat before him, alive, real, watching him intently, as if reading his thoughts.\n— You said you survived, but you don’t know how, — the old man said, running a hand through his beard, studying him. — Perhaps because your path is not yet finished. Or perhaps because someone very much wants it to remain unfinished.\nAbu Bakr grimaced. He didn’t like riddles. He preferred clarity—either you’re alive, or you’re dead. Everything else was nonsense.\n— I don’t care why I’m alive. What matters is why I’m here.\nHe pulled himself up, sat straighter, and finally said:\n— I came for you, Ibn Arabi. By order of the emir.\nThe old man didn’t flinch.\n— And what does your emir want with me?\n— They didn’t tell me, — Abu Bakr said, rubbing his temples. — I only know I’m to bring you to the palace, whole and unharmed. And that there’s no refusing.\nThe old man sighed.\n— No refusing… — he echoed softly, as if testing the thought. — Amusing. As if a man ever had the right to refuse.\nHe fell silent for a moment, gazing somewhere far off, beyond the sands, beyond the horizon.\n— I knew this day would come.\nHis voice was calm, but there was something in it… weary.\nAbu Bakr couldn’t tell if he liked it or not.\n— So, you’ll come with me?\nIbn Arabi looked him straight in the eyes.\n— I cannot refuse the emir.\nHe said it not with submission, but with a kind of inevitability, as if he already knew all paths led to the same place.\nAbu Bakr nodded.\nHe didn’t know why the emir wanted this old man. He didn’t know why his warriors had to die for this man to be here, alive, or where the bodies of his comrades had vanished while he lay unconscious. But one thing he understood clearly.\nThis journey was only beginning."
    },
    {
        "title": "Chapter 7",
        "content": "The road was long and grueling. The sun scorched their backs all day, and the wind carried sand, burying their tracks as if erasing their existence.\nWhen they reached a small village at the edge of the desert, the sun was nearly gone beyond the horizon. At first, the village seemed long abandoned. The houses were crumbling, roofs caved in, streets empty. Only in the center stood a large, weathered building, with faint light seeping from under its door.\nAbu Bakr moved toward it first, cautiously resting his hand on the hilt of his saber.\n— A dead place, — he muttered, glancing around.\n— And yet it breathes, — Ibn Arabi replied quietly, noticing small shadows flitting behind the window frames.\nAs they drew closer, the door opened, and a man well past middle age stood before them—thin, with deep wrinkles betraying his weariness.\n— Travelers? — he asked, showing neither fear nor hostility.\n— Good evening, indeed we are travelers, — Ibn Arabi confirmed.\nThe man nodded and stepped aside, inviting them in.\nInside, it was unexpectedly warm. Dozens of children’s faces peered at them from the shadows—some with curiosity, others with caution. Some clung to the walls, while others boldly stepped closer.\n— This is an orphanage, — the man explained. — They’re alone. War, disease, hunger… each one has lost their family. Now I am their family.\nAbu Bakr looked around, his usually mocking gaze turning serious.\n— You care for them alone?\n— Who else, if not me?\nThe reply was simple, without bitterness.\nIbn Arabi knelt before a boy of about ten, whose gaunt face looked too old for his years.\n— What’s your name, son?\n— Rashid, — the boy answered, lifting his chin, trying to appear braver than he felt.\n— Rashid, — Ibn Arabi repeated with a gentle smile. — And why aren’t you asleep at this late hour?\n— Because the night here isn’t for sleeping, — the boy said softly.\nIbn Arabi glanced at the man.\n— What does he mean?\nBefore the caretaker could respond, an older girl stepped forward and said:\n— Stay with us tonight. Then you’ll understand.\nAbu Bakr chuckled and crossed his arms.\n— Sounds like a trap. If you’re planning to rob us, know that we’ve got almost nothing with us.\nA few children giggled, but the girl remained serious.\n— It’s not safe outside at night. Better to stay inside.\nAbu Bakr and Ibn Arabi exchanged a glance.\n— Well then, — the warrior said, settling onto one of the rugs. — Let’s see what fears lurk in this place."
    },
    {
        "title": "Chapter 8",
        "content": "The evening was warm, filled with the quiet voices of children and the crackling of old candles. Despite the worn walls and empty shelves, the house didn’t feel impoverished—only steeped in a deep weariness, as if the very air was saturated with others’ memories.\nAbu Bakr quickly found common ground with the children. He sat among them, waving his arms, recounting funny stories of his battles.\n— Picture this: me, alone, against forty of them! They surrounded me like jackals… But I was faster! One swing—and my sword sliced through the air like the wind, straight into an enemy’s helmet! It made a sound like someone dropped a cauldron on stone!\nThe children burst into laughter.\n— Then what?! — a boy shouted, bouncing with excitement.\nAbu Bakr grabbed a piece of flatbread, took a bite, and answered with his mouth full:\n— Then another swing, and there was one less! Then another! And another! By the end of the battle, I was too tired to keep count!\nThe children roared with laughter, clapping their hands. Even the shyest among them gazed at him with admiration.\nMeanwhile, Ibn Arabi sat aside, closely observing the caretaker. They drank tea, seated on the floor, watching the lively scene.\n— Do you often have visitors? — the sage asked gently, wrapping his hands around the warm cup.\nThe caretaker shrugged:\n— Few come here. People avoid this place. They say it’s cursed.\n— And what do you think? Is it cursed?\nThe man gave a faint smile, but there was no mirth in it.\n— A curse is when you know nothing will change. No matter what you do, time devours everything.\nIbn Arabi peered intently into the man’s face. There was something… strange about it. The face looked weary, but the eyes were too… still. As if there was neither soul nor pain behind them.\n— And yet, — he continued, leaning closer, — you stayed here, with the children. Why?\nThe man didn’t answer for a long time, staring into the darkness beyond the window.\n— Because someone has to.\nHis voice sounded too hollow, too even.\nIbn Arabi felt a faint chill run down his spine.\nHe glanced at the caretaker’s hands. The long fingers seemed utterly motionless. Even when he drank his tea, the gesture was mechanical, as if rehearsed.\n— You’ve been through a lot, haven’t you? — the sage said cautiously.\nThe caretaker smiled.\n— Like everyone here.\nBut that smile was not human.\nAt that moment, Abu Bakr let out a loud laugh, tossing one of the younger children into the air.\n— Look how light you are! I could send you soaring like a bird!\nI $@bn Arabi turned his gaze away from the caretaker, but the feeling that something was wrong lingered.\nThere was something about this man… something that wasn’t as it should be.\nAnd the night had not yet fallen."
    },
    {
        "title": "Chapter 9",
        "content": "Night fell over the village like a thick velvet shroud, pierced only by the occasional gusts of nocturnal wind. In the orphanage, everyone was asleep. The children huddled together like puppies, their breathing soft and serene.\nAbu Bakr and Ibn Arabi had finished their evening prayers. Folding their belongings, they prepared for an early departure. But suddenly, a long, ominous howl tore through the night.\nIbn Arabi froze, then approached the window. In the moonlight, a silhouette flickered among the sand dunes—too large for a jackal, too swift for a camel.\n— I didn’t know wolves roamed the desert, — Abu Bakr muttered, fastening his weapon belt.\n— I’ve read of Arabian and Indian wolves, — Arabi replied, still peering into the darkness. — But they don’t grow large. That voice… it belongs to no small beast.\nAbu Bakr frowned, then decisively grabbed his saber and headed for the door.\n— I’ll go take a look. You stay here.\nThe door creaked, releasing the warrior into the darkness. The night air was cool, infused with the scent of sand and the solitude of the desert.\nHe moved slowly, tense, catching the slightest sound. In the distance, a low, menacing growl echoed, as if the desert itself had come alive and spoken.\nAbu Bakr stepped beyond the village’s edge, where the faint moonlight illuminated the dunes. There, against the inky sky, an unbelievable scene unfolded.\nA massive white wolf, glowing like a snowy specter, was tearing apart a group of men.\nBandits, clad in filthy rags, screamed, their cries ringing through the night as the beast, its icy eyes gleaming, sank its fangs into their flesh. One tried to draw a dagger, but the wolf leaped, severing his throat in a single motion.\nThe sand was already soaked with blood.\nThe wolf didn’t merely kill. It mauled, tore, as if fulfilling some ancient, brutal will that transcended man and beast.\nAbu Bakr gripped the hilt of his saber but didn’t move.\nThe beast suddenly stopped. Its radiant eyes slowly rose, meeting the warrior’s gaze.\nComplete silence fell.\nA moment suspended between worlds.\nAbu Bakr neither retreated nor attacked.\nThe wolf stared at him, as if assessing, as if… acknowledging.\nThen, slowly, without a sound, the beast turned and vanished into the night, leaving behind only cold and the smell of blood."
    },
    {
        "title": "Chapter 10",
        "content": "The morning sun rose slowly over the horizon, bathing the village in warm golden light. The air was fresh, and the chill of the night had not yet fully dissipated.\nAbu Bakr sat leaning against a wall, his fingers tracing the edge of his saber. His gaze was distant, his thoughts circling back to the vision of the previous night. The white wolf. It could have torn him apart in an instant, yet instead, it simply left, silently, as if leaving him some kind of sign.\n— You’re quieter today than ever, — Ibn Arabi remarked, studying his companion closely.\n— That beast… It killed those men without a hint of hesitation. But when it saw me, it didn’t even growl. Why?\nArabi merely shrugged:\n— Some creatures act not by the will of flesh, but by the will of something else.\nAbu Bakr gave a wry smile:\n— By the will of what? Allah or the devil?\n— Who knows…\nTheir conversation was interrupted as children rushed into the room, laughing and shouting over one another. They leaped around Abu Bakr, grabbing at his hands and cloak, begging him to stay just one more day.\n— Hey, hey! Let go, you little rascal, or I’ll gobble you up! — the warrior teased, pretending to bare his teeth.\nThe children giggled and clung to him like an old friend.\nBut the time to leave had come.\nGathering their belongings, they stepped into the common room. The caretaker of the orphanage was already waiting by the door, tall and reserved, his gaze inscrutable.\n— Thank you for your hospitality, brother, — Ibn Arabi said, bowing.\nThe caretaker nodded, smiling:\n— You are always welcome here. The road through the desert is treacherous. May Allah protect you.\nAbu Bakr clasped his hand in a firm handshake but suddenly noticed something odd.\nOn the man’s wrist was a fresh wound.\nThe warrior frowned:\n— You’re injured. When did you get that scratch?\nThe caretaker froze for a moment but quickly waved it off:\n— Oh, it’s nothing! Last night, one of the children woke up in a panic, and while trying to calm him, I accidentally cut myself on a broken bedframe. No matter.\nAbu Bakr narrowed his eyes. The story sounded… too convenient. But before he could say anything, the caretaker clapped him on the shoulder, nudging him toward the door.\n— Go now, warriors, the sun waits for no one.\nThey stepped outside, and the door closed behind them.\nAbu Bakr cast one last glance at the building, then looked down at his palms, as if expecting to find a trace of white fur.\nBut there was none.\nAnd yet, somehow, he knew—this would not be the last time he encountered that wolf."
    },
    {
        "title": "Chapter 11",
        "content": "The desert stretched around them like a boundless golden ocean, its dunes shimmering in the light of the setting sun, like shifting waves. The heat of the day was fading, leaving behind a dry, prickly wind that carried the scent of scorched sand.\nExhausted from the journey, Abu Bakr and Ibn Arabi stopped at the foot of a small hill where the wind was less fierce. Setting up a simple camp, they kindled a fire from dry branches gathered along the way.\nAbu Bakr wearily settled by the fire, removed his boots, and, stretching his legs with relief, began rubbing his tired feet.\n— What a brutal day, — he muttered, pulling a small piece of dried meat from his pack. — I’ve fought warriors, bandits, even the devil himself in his many forms, but I can’t conquer this cursed thirst!\nArabi chuckled, pouring water into two small clay cups:\n— Have you ever considered that the fiercest war is the one you fight with yourself?\nAbu Bakr took the cup, drained it in one gulp, and snorted:\n— I fight enemies, not myself. I’m my own friend. Enemies are just obstacles in my path.\nArabi looked at him intently:\n— And what if the path doesn’t lead where you want?\nThe warrior leaned back, resting his hands behind his head.\n— Doesn’t matter. I’ll get there anyway.\nThey fell silent for a while, listening to the crackling of the fire.\nThen Abu Bakr, shaking his head, gave a wry chuckle:\n— You’ve barely said a word about yourself, old man. I’ve told you about dozens of battles, how I once took down forty bandits, and how I defeated an enemy with just a belt and faith in my luck. But you? You stay quiet.\nArabi smiled and tossed a dry branch into the fire.\n— My life wasn’t lived on battlefields, but in books, in thoughts. While you were cutting down enemies, I was slicing time into numbers, breaking it into fractions and equations.\nAbu Bakr frowned:\n— You’re starting with your fancy talk again. Speak plainly.\n— Alright. For example, did you know that if you set two posts in the desert, stretch a rope between them, and then drop a stone onto it, the stone will always fall at a specific angle, no matter the height of the drop?\nAbu Bakr propped himself up on his elbows and stared at Arabi as if he were mad:\n— Why would I need to know that? A rope is a rope, a stone is a stone. If I throw a stone, it just falls.\n— But why does it fall that way and not another? Why does the shadow of a post move with the time of day? Why do the stars always follow their unchanging paths?\nThe warrior scowled and shook his head:\n— Allah willed it so. That’s it. End of story.\n— And what if Allah willed you to understand how this world is made? If knowledge is the key He gave you, and you just tossed it into the sand?\nAbu Bakr grimaced, sighed, and waved a hand:\n— You really want me to think about this after such a long day?\n— Isn’t it interesting?\n— No, it’s not! If you want to think about stones and ropes, that’s your business, but I want to think about a warm bed and the morning sun.\nWith that, he yawned, lay back, and closed his eyes.\n— Your numbers can stay out of my nightmares.\nArabi only chuckled and continued gazing into the fire.\nA fire in the desert is a strange companion. It consumes everything around it, but in its dancing flames, one can glimpse the past and the future.\nOr perhaps even something greater."
    },
    {
        "title": "Chapter 12",
        "content": "The sun hung over the desert like a molten disc, offering no chance to escape its unrelenting gaze. The sand scorched any bare skin, and the air shimmered like the strings of a lute, woven from heat and madness.\nAbu Bakr and Ibn Arabi trudged in silence. Their lips were cracked, their eyes red, their breathing labored. Their waterskins had long been empty, and food was but a memory.\nSuddenly, an oasis appeared ahead—a wide expanse of water, lush green palms, a gentle breeze stirring the leaves…\n— Allah is merciful! — Abu Bakr gasped, summoning the last of his strength and rushing forward.\nBut the closer they got, the more something seemed amiss. The water didn’t ripple, the leaves didn’t rustle. And then, as they nearly reached the edge of this paradise, the oasis flickered like a shattered mirror and vanished.\nBefore them stretched only the merciless desert once more.\nAbu Bakr froze, panting heavily, then laughed in disbelief:\n— A damned mirage… The cursed desert is mocking us!\nIbn Arabi tilted his head, lost in thought. Then, scanning the surroundings, he noticed a low-growing cactus with thick, fleshy stems.\n— We’re not entirely helpless, my friend.\nHe crouched, broke off a piece of the plant, and began stripping it of spines.\n— What are you doing? — Abu Bakr frowned.\n— Cacti hold moisture. It’s not water, but it’ll keep us going.\nAbu Bakr grabbed a piece and bit into it greedily, swallowing the bitter, juicy flesh without chewing.\n— Ugh! Tastes like donkey hide.\n— Better than dying of thirst.\nThey ate the cactus, unaware they had made a mistake.\nAt first, nothing happened. Their thirst dulled slightly, and the heat no longer felt so torturous.\nBut soon, the desert began to change.\nThe light grew brighter, as if someone had ignited thousands of lanterns in the sky. The dunes curved and pulsed, as if breathing. Shadows on the sand took the shapes of strange beings—faceless humans, winged beasts, enormous eyes watching from the depths of the sandy waves.\nAbu Bakr stopped, rubbing his temples:\n— Do… do you see this too?\nIbn Arabi didn’t answer. He stood gazing at the sky, his eyes reflecting the cosmos—thousands of stars swirling, merging into myriad patterns.\nThe wind sang ancient songs that didn’t exist.\nVoices whispered in the air.\n“Are you dreaming or awake?”\n“Where were you before birth?”\n“Where do you go after death?”\nAbu Bakr clutched the hilt of his saber, but his hands trembled.\n— What’s happening? What did you do, old man?!\nIbn Arabi smiled, his voice calm, like a breeze among stones:\n— We’ve simply seen the world… without its veil."
    },
    {
        "title": "Chapter 13",
        "content": "— WHAT HAVE YOU DONE?! — Abu Bakr seized Ibn Arabi by the collar, shaking him with a force that could have broken an ordinary man. — What did you give us, Sufi?! Is this your magic? Your sorcerous deceit?!\nBut before Ibn Arabi could respond, the ground trembled beneath their feet. The sand swirled, rising in golden spirals that coiled around them like enormous serpents. The sky shattered, splintering into thousands of fragments, revealing something infinitely greater beyond its edge.\nAbu Bakr felt his body grow light, as if torn from his own flesh.\nHe was falling.\nBut not downward—he was falling through time, through worlds, through stars that pierced his consciousness, leaving fiery trails across his mind.\nVisions unfolded before him:\nMassive metal machines moved along roads like iron beasts, guided by men. Towers soared into the heavens, their glass walls reflecting the light of an alien sun. People dressed strangely, speaking a language he understood but had never heard before.\nHis body swept past, through this world, but he knew—this was no dream. This was truth.\nBut then, amidst the raging chaos, he saw her.\nBlack hair cascaded over her shoulders in soft waves. Eyes, deep as the night sky, filled with mysteries he could never unravel. She stood nearby, bathed in an unseen light, smiling.\n— Abu Bakr… — she whispered.\nHer voice was warm, familiar, like a forgotten melody from childhood.\nHe knew her.\nBut from where?\nHe lunged toward her, his hands reaching, his heart breaking free from his chest like a prisoner yearning for freedom.\nBut the closer he got, the farther she drifted.\n— Wait! Don’t go! — he cried, but his voice drowned in the roaring whirlwind.\nThe world erupted in golden fire, and his consciousness shattered into a thousand fragments.\nEverything vanished.\nDarkness.\nSilence.\nAnd then—emptiness."
    },
    {
        "title": "Chapter 14",
        "content": "Abu Bakr opened his eyes, feeling something light and small nudge his shoulder. He blinked, but before he could make out who it was, tiny figures with mischievous smiles scurried away, leaving behind only the sound of bright childish laughter. He ran a hand over his face, feeling dry skin caked with sand, and slowly sat up.\nA few steps away, Ibn Arabi was speaking with a man dressed in the fine robes of a merchant, behind whom stretched a long caravan. Camels grumbled with hoarse sounds, servants bustled between the laden animals, and heavy chests filled with fabrics, spices, and water seemed like a mirage too good to be real.\nAbu Bakr brushed a hand through his hair, shook the sand from his clothes, and approached them. The merchant, smiling, said something to Ibn Arabi, who nodded, handed him a small bundle, and the caravan began to move. Several servants approached, carrying waterskins and flatbreads that wafted with the aroma of spices.\nAbu Bakr wearily rubbed his temples, still feeling the pulsing echoes of the strange dream in his head. Ibn Arabi turned to him with a sly smile.\n— You woke at just the right moment, my friend, — he said, tossing him a waterskin. — I managed to strike a deal with this kind man. We won’t die of thirst or hunger.\nAbu Bakr drank greedily, spilling a few drops onto his chest, then wiped his mouth with the back of his hand.\n— So, while I was sleeping, you’ve already made friends, eh? — he grinned. — How much did you talk his ear off for this feast?\n— Oh, very little, — Ibn Arabi replied calmly, sitting on the sand. — Just a couple of truths about the fleeting nature of gold and how good deeds return a hundredfold.\nAbu Bakr laughed, grabbed a piece of flatbread, and bit into it eagerly.\n— Next time, wake me earlier before you trade my boots for another piece of wisdom.\nHe playfully shook a fist at Arabi, who only spread his hands with a smile.\nThey sat side by side in silence, accepting the food as a gift of fate, not bothering with questions about how many trials still awaited them ahead."
    },
    {
        "title": "Chapter 15",
        "content": "The city at the edge of the desert rose before them like a mirage given flesh and stone. Mud-brick walls, peeling from wind and time, framed bustling streets filled with the scents of spices, roasted meat, and dust. At the gates stood guards in modest but well-kept armor. Their swords, though unadorned with lavish decorations, looked sharp and ready for battle.\n— Pass through, travelers, — one of them said, lazily waving a hand.\nAbu Bakr exhaled with relief and clapped Ibn Arabi on the shoulder.\n— At least we’ve reached a place where we can drink water without fear of a demon lurking in it.\n— Don’t be so sure, my friend, — Ibn Arabi smiled. — Demons aren’t only in the desert. Sometimes they hide in people.\nPassing through the gates, they immediately stumbled upon two men sitting astride donkeys, arguing loudly enough to fill the street.\n— What, are you blind? — one shouted, slapping his donkey’s flank. — Mine’s the best in the whole city! Look at his back—broad, sturdy, and he doesn’t complain when I load him with sacks!\n— Oh, stop spouting nonsense! — the other scoffed, stroking his donkey’s neck. — My donkey eats less but travels farther. And his tail is longer, which means his lineage traces back to the finest caravan donkeys of the East!\n— Lineage?! — the first roared. — Yours is just scrawny! Mine has perfect posture. I swear by Allah, when we walk down the street, everyone turns to look at him!\n— Who needs your donkey when I’ve got a leather saddle, not that rag of yours!\n— Well, my bridle has a tag engraved with the master’s name! That’s a mark of the highest quality!\nAbu Bakr and Ibn Arabi exchanged glances. The warrior’s eyes betrayed undisguised astonishment, while the Sufi merely shook his head.\n— Even in distant lands, fools find something to argue about, — Ibn Arabi muttered.\n— This isn’t an argument; it’s a disease, — Abu Bakr chuckled. — Like two rich men boasting about chariots, except all they’ve got are donkeys.\n— Should we tell them they both look ridiculous?\n— Nah, let them live in their delusion. It’s more entertaining.\nThey sidestepped the bickering pair, casting them final mocking glances, and plunged into the noisy bazaar, where merchants were already spreading out a world of wondrous goods before them."
    },
    {
        "title": "Chapter 16",
        "content": "The bazaar greeted Abu Bakr and Ibn Arabi with a buzzing chaos, as if the cosmos itself had decided to gather all the world’s colors, sounds, and scents in one place. After long days in the desert, with only wind and sand as companions, this human whirlwind felt both alien and alluring. They had endured much together—from ambushes by desert phantoms to encounters with an infinity that whispered their names. But now the desert lay behind them, and ahead sprawled a city—nameless, ancient, brimming with secrets.\nThe bazaar hummed like a beehive. Traders in vibrant turbans shouted prices for everything imaginable: silks from Khorasan, shimmering like the sunset sky; copper lamps with engravings promising light even in the darkest night; dates glistening like precious gems; and spices that made the head spin—saffron, cinnamon, black pepper. In a corner, an old woman in black peddled bone amulets—no one knew whose bones, but her gaze made passersby quicken their steps.\nAbu Bakr strode ahead, his broad frame parting the crowd like a ship cutting through waves. His worn saber swayed at his hip, and his eyes gleamed with reckless daring. He inhaled deeply and burst into laughter.\n— Ha! Look at this, old man! There’s more life here than in the whole desert combined! Maybe the emir can wait, and we’ll grab a couple of rugs and a jug of wine? Picture it: me, the terror of bazaars, and you, my wise advisor. We’ll trade jinn we catch ourselves!\nIbn Arabi, walking slightly behind, shook his head, though a faint smile played at the corners of his lips. His black staff tapped the stones, and his gaze drifted over the faces in the crowd, as if seeing something beyond the visible.\n— You’d sell a jinn for half a dinar and a cup of water, Abu Bakr, — he replied softly. — But beware: not everything that glitters in this bazaar is meant for mortal hands.\n— Oh, your riddles again! — Abu Bakr slapped his thigh. — Last time you talked like that about that cursed oasis, and it turned out to be just a mirage. Maybe you’re just scared I’ll find a beauty here and steal her right from under your nose?\nThe Sufi paused, looking at the warrior with mild reproach, though his voice carried warmth.\n— You’d convince her to dance on sabers, then wonder why she ran off. You’ve got the heart of a lion, Abu Bakr, but sometimes a head as stubborn and empty as a camel’s.\nAbu Bakr roared with laughter, so loud that a nearby trader nearly dropped his basket of nuts.\n— Ha! A camel, you say? Well, at least I don’t spit like some of those wise books you read to me by the fire. “Why do the shadows of a stick and a stone fall differently depending on the time?” — he mimicked, throwing his hands up theatrically. — Tell me, old man, what would you buy in this bazaar? We’ve had enough sand.\nIbn Arabi thoughtfully traced the patterns on his staff.\n— For now, provisions for the road, — he replied. — Food and water. But if I had to choose from here, — he nodded toward a stall with clay vessels, — something simple. Depth lies in simplicity.\nThey continued walking, trading words like old friends whose souls had been forged in the crucible of shared trials. Abu Bakr teased the Sufi, who responded with restraint but with a spark that betrayed his enjoyment of their banter. The crowd flowed around them, and suddenly Abu Bakr’s gaze caught something odd.\nAt the edge of the bazaar, in the shadow of a crooked alley, crouched a small shop. Its sign—a weathered board without a single inscription—hung precariously on rusty chains. The storefront was draped in tattered cloth, and the slightly ajar door creaked in the faint breeze. No onlookers gathered around, no traders shouted. Only a lone raven perched on the roof, watching the travelers with eyes as black as night.\n— Look at that, old man, — Abu Bakr nudged Ibn Arabi with a grin. — There’s your truth hiding! Or maybe that’s where the old woman with the amulets keeps a couple of jinn in a chest? Come on, let’s check it out. If anything, I’ll sell them for a dinar and buy us a better camel.\nIbn Arabi frowned but followed the warrior. Something about the place made his fingers tighten around his staff. They drew closer, and the air around the shop grew heavier, as if steeped in ancient secrets.\nInside, it was cramped and dark. Shelves sagged under the weight of strange items: cracked mirrors, faceless statuettes, scrolls with faded script. Behind the counter stood the owner—a gaunt man in a black robe, his face shrouded in shadow. His long, bony fingers flicked through prayer beads with unnatural speed.\n— Welcome, — his voice was dry as desert wind, yet laced with a hidden sweetness, like honey mixed with poison. — Looking for something special?\nAbu Bakr, wasting no time, nodded toward a shelf.\n— Give me something unusual, trader. But don’t offer me sand—I’ve got plenty in my boots already.\nThe owner tilted his head and retrieved a small vessel from the shelf—clay, coated in black glaze, etched with symbols resembling ancient script. He set it on the counter with a soft thud, and at that moment, a shadow in the corner of the room stirred, though there was no breeze.\n— This, — he said, staring directly at Abu Bakr, — is not for everyone. But you, warrior, are worthy of it. Imagine: power to crush your enemies, wealth to outshine the emir’s palace. Three dinars—and your dreams become reality.\nAbu Bakr clapped his hands, his eyes alight.\n— Ha! Hear that, old man? Power and wealth! Maybe I’ll buy this, and then I’ll have the emir bowing to me! Three dinars—a trifle for such a marvel.\nHe reached for his pouch, but Ibn Arabi suddenly placed a hand on his shoulder. His voice, usually gentle, turned hard as steel.\n— Stop, Abu Bakr. This is no trinket. Don’t you see the darkness coiling around that vessel? Allah forbids us to touch what reeks of Shaitan. This isn’t wealth—it’s chains.\nAbu Bakr froze, but the shopkeeper leaned closer, a reddish glint flickering in his eyes.\n— Don’t listen to him, warrior, — he hissed. — Your friend fears power. Aren’t you tired of being a pawn? Take the vessel—and become the master of your fate. Isn’t that what you want?\nAbu Bakr hesitated, his fingers trembling over the pouch. Temptation tugged at him like a rope, but Ibn Arabi’s voice cut through the haze like a beam of light.\n— Abu Bakr, remember who you are. You’re the only one of your band left alive, who stood against the phantoms of the desert. You’re a warrior of Allah, not a servant of Shaitan. It is written in the Quran: “And do not follow Shaitan, for he is your clear enemy.” The wealth of this world is dust, but true strength lies in a heart that doesn’t bow to lies.\nThe Sufi’s words fell like stones into still water, and Abu Bakr’s eyes cleared. He stepped back from the counter, slapping his forehead.\n— Ha! Nearly fell for it, old man! This bony trickster almost conned me into buying a pot with a hole in it. Let him drink his own wealth from it!\nThe shopkeeper straightened, and the shadow behind him darkened, but he said nothing. Ibn Arabi turned toward the door, pulling Abu Bakr along.\n— Come, — he said softly. — True wealth awaits us on the path to Allah, not in the devil’s grasp.\nThey stepped back into the noisy bazaar, and the air grew light again. Abu Bakr, still chuckling, clapped the Sufi on the back.\n— You’re right, old man. I’ll stick to buying dates and water. That “trader” looked like a jinn had possessed him!\nIbn Arabi smiled, but unease lingered in his heart. He knew: Shaitan doesn’t give up so easily. The vessel remained in the shop, but the shadow of temptation had already touched their path."
    },
    {
        "title": "Chapter 17",
        "content": "Leaving the shadowy alley with its sinister shop behind, Abu Bakr and Ibn Arabi melted back into the bustling current of the bazaar, but their path now led deeper—to the heart of the city, where a mosque rose like a pearl in the desert’s shell. Its dome gleamed under the sun, a celestial vault painted with stars, and its minarets stretched toward the sky like arrows loosed into infinity. Yet the road to holiness is rarely straight, and Shaitan, holding his breath, was already weaving new snares.\nThey walked down a narrow street where the breeze carried scents of jasmine and musk, when a vision woven of temptation appeared before Abu Bakr. From the carved doors of a house with crimson curtains stepped forth women—Persian beauties with eyes like black agates and foreigners with hair flowing like rivers of gold. Their laughter chimed like silver bells, their movements soft as cloud shadows on sand. One, with a smile sharp as a blade, approached the warrior, extending a hand.\n— O mighty traveler, — she sang, her voice sweeter than honey, — rest with us. Here there is no sand, no heat—only coolness and joy. Do you not deserve this after so many battles?\nAbu Bakr halted, his broad chest heaving, a roguish glint in his eyes. He opened his mouth to reply, but Ibn Arabi, swift as a ray of light, barred his path with his staff.\n— Abu Bakr, — the Sufi’s voice was firm yet gentle, like a father’s, — recall the zikr we chanted in the desert: *La ilaha illa Allah*. There is no god but Allah, and no path but His. These nets are not rest but shackles. Shaitan paints a mirage, but beyond it lies only emptiness. Come, let us seek what purifies the heart.\nAbu Bakr frowned, his hand twitching as it gripped his saber’s hilt. A storm raged within him: temptation pulled like a rope, while the Sufi’s words cut like a blade. He turned to Ibn Arabi, his eyes flashing.\n— Easy for you to say, old man! You sit in your visions and books, but I’m a living man! After all this dust and blood, can’t I take a drop of joy? Or does your Allah want me to die of boredom chanting your prayers?\nIbn Arabi did not waver, his gaze calm as a lake under moonlight.\n— The joy Shaitan offers is poison in a golden cup. You are a warrior, Abu Bakr, but your battle is not only with enemies—it is with yourself. It is said: *He who conquers his passions is greater than he who takes a city.* Come, my brother, do not let the darkness in your heart prevail.\nAbu Bakr clenched his fists, his face contorted with inner struggle. He glanced at the women—their laughter still rang in his ears, promising oblivion—then at the Sufi, whose figure stood resolute as a rock. At last, he spat on the ground and waved a hand.\n— Fine, curse you, old man! Let’s go to your mosque, but if it’s just dust and sermons, I’ll come back here and drink with these beauties on your dime! — He stormed ahead, muttering under his breath: — Zikr, zikr… I’d rather you stuffed a jinn into my saber than these lectures…\nIbn Arabi smiled faintly and followed. The women, their enchantment broken, dissolved into the shadows like smoke from a doused fire, and the wind carried their laughter into nothingness.\nAs they entered the mosque’s arches, they were met by the coolness of marble and the scent of frankincense, mingled with the breath of hundreds of voices whispering *dua*. Light poured through stained glass, shattering into a thousand hues—sapphire, emerald, ruby—and fell upon carpets where worshippers bowed in unison, like the heartbeat of the earth. Abu Bakr, still sullen, crossed his arms but fell silent, struck by the majesty of the place.\nThey joined the *namaz*, and even the grumbling warrior bowed his head, though his lips moved more from habit than faith.\nAfter the prayer, as the worshippers dispersed, Ibn Arabi noticed a figure in a white robe sitting in a corner with a book in hand. It was a man with a face etched by lines of thought and eyes reflecting an abyss of knowledge. His name was Ibn Sina—physician, mathematician, philosopher, whose fame resounded from Cordoba to Samarkand. Guided by intuition, Ibn Arabi approached him, leaving Abu Bakr to grumble nearby.\n— Peace be upon you, O wise one, — Ibn Arabi began. — I see in you one who measures not only the length of shadows but the depth of the soul.\nIbn Sina smiled, setting aside a scroll covered in diagrams and Arabic script.\n— And peace upon you, O traveler. You are right: I seek harmony between the seen and the unseen. Tell me, do you believe existence is separate from essence, as a ray is from the sun?\nIbn Arabi pondered, tapping his staff on the floor.\n— I see it differently. Essence is like a seed, and existence the tree that grows from it. All flows from *al-Wahid*, the One, and there is no division in His design. But you, master of geometry and medicine, how do you explain the motion of the heavens through numbers?\nIbn Sina pointed to a diagram—a circle inscribed in a square, with lines radiating from the center.\n— Behold: the sphere of the heavens moves by laws Allah embedded in creation. I have calculated them through *al-jabr* and Euclid’s proportions, for numbers are the language the world speaks. Yet the human body is the same cosmos: blood flows like rivers, and the pulse beats like stars in their dance. Is not the soul the point where these lines converge?\nIbn Arabi nodded, his gaze deepening.\n— Yes, but the soul is not a point—it is a mirror. It reflects the Divine light, and in that reflection lies its being. You speak of the *Necessary Existent*, whose essence is inseparable from existence. I see in this the unity of *tawhid*: all exists because He is.\nAbu Bakr, sitting nearby and fidgeting with his cloak, finally lost patience and muttered:\n— Ha! You two talk like I need to slice that circle with my saber to understand it! Old man, this new friend of yours will tangle us in stars, and I still won’t find water for the camel!\nIbn Sina laughed, his laughter clear as a spring in the desert.\n— O warrior, I won’t entangle but guide. Tell me: if I heal your wound or calculate the distance to the emir’s palace, will you believe knowledge is also worship?\nAbu Bakr snorted, though a spark of interest flickered in his eyes.\n— If you give me water and teach my camel not to spit, I might listen to your sermons. But for now, my saber’s worth more than all these circles!\nThus began their encounter with Ibn Sina. While Abu Bakr grumbled but stayed close, Ibn Arabi and the sage continued their discourse, weaving metaphysics with practical sciences. They spoke of the *Kitab al-Shifa* and the healing of the soul, of planetary motion and its influence on fates, of how the *hukm* (judgment) of reason leads to the *hikma* (wisdom) of Allah. In this exchange of ideas, beneath the mosque’s arches, their path gained new light—a light of knowledge that shines brighter than Shaitan’s temptations, even if Abu Bakr’s heart still smoldered with embers of doubt."
    },
    {
        "title": "Chapter 18",
        "content": "The sun dipped toward the horizon, bathing the mosque in golden light that streamed through the stained glass like the breath of the heavens. After the *namaz*, Ibn Arabi and Ibn Sina lingered in the shadow of the columns, surrounded by scrolls and a silence broken only by the rustle of pages and the occasional footsteps of worshippers. Abu Bakr sat nearby, leaning against a wall, lazily cleaning his nails with the tip of his dagger, casting glances at the two sages whose words seemed to him like riddles carved in sand by the wind.\nIbn Sina began, unrolling a scroll before Ibn Arabi, covered in diagrams and Arabic script.\n— Behold, O traveler, — he said, pointing to a schematic of the human body, its veins and bones drawn with a geometer’s precision. — I have spent years studying this vessel Allah granted us. I am working on a book that describes how blood flows through arteries, like rivers in a miniature cosmos, and how the pulse measures life, like the clock of the heavens. I discovered that diseases arise not from the wrath of jinn but from an imbalance of the four humors—blood, phlegm, yellow bile, and black bile. Through *al-jabr* and observation, I calculated the motion of the stars that influences these humors, proving that the mind can govern the body if its laws are known.\nIbn Arabi listened, head tilted, as if attuned to the melody of a distant instrument. His fingers thoughtfully traced the patterns on his staff.\n— Your discoveries are a beacon in the dark cave of matter, O Ibn Sina, — he replied. — You have extended humanity’s reach to the stars and the depths of flesh, a great gift. But tell me: does it not seem that we have ventured so far into knowing the world around us that we’ve forgotten to look within? We know how planets move and how to heal wounds, but we know almost nothing of the soul that reflects the Divine. This blindness is the root of human suffering. We build cities but lose ourselves.\nIbn Sina nodded, his gaze deepening like a well reflecting the sky.\n— You are right, O Sufi. The soul is a riddle that eludes the scalpel and numbers. But I believe both paths are lawful and beneficial. Science is the thread Allah has given us to comprehend His creation. Through medicine, I see existence as a machine, its gears the nerves, bones, and blood. I call it the *Necessary Existent*—that whose essence is inseparable from being, for Allah crafted it with measurable precision. Is this not the grandeur of His design?\nIbn Arabi smiled, his smile soft as moonlight on still water.\n— The grandeur of His design is beyond doubt. But I see existence differently—not as a machine, but as a mirror. The soul defies numbers, for it is a reflection of *al-Wahid*, the One. Through *zikr* and contemplation, I grasp that the world within us is a book written not in ink but in light. You speak of the laws of the body; I speak of the secret script of the spirit. Suffering arises when man seeks himself in the sand of the outer world without peering into the well of his heart.\nIbn Sina thoughtfully traced a finger over the scroll, where an anatomical drawing sat beside a circle with radii—a symbol of the celestial sphere.\n— Your mirror metaphor intrigues me, — he said. — But let me add a nuance. I see body and soul as two sides of a coin: the body is the manifestation, the soul its cause. My medicine teaches that the mind can heal the flesh if brought into harmony with nature. Does not the Quran say: *We created man in the finest form*? Science and faith are two wings that lift us to truth.\nIbn Arabi nodded, a spark of mystical fire kindling in his eyes.\n— Yes, but these wings differ. You measure harmony through proportions and scales; I measure it through *tawhid* and unity with He who transcends all measure. Humanity suffers because it seeks causes outwardly, not in what lies beyond the veil. Tell me, O wise one, if you know how to heal the body, do you know how to heal the soul’s longing that knows not its source?\nIbn Sina fell silent, gazing at the light fracturing through the stained glass into a thousand rays.\n— The soul’s longing… — he said slowly. — That is a question that slips from my pen. I can prescribe herbs for a heart that beats unevenly, but for a heart seeking Allah, I have no remedy. Here, your path, O Sufi, stretches beyond mine.\nAbu Bakr, silent until now, snorted and jabbed his dagger into the air.\n— Ha! You two talk of mirrors and coins, and here I sit thinking: if the soul’s a book, mine’s blank, and if it’s a machine, it’s broken! Maybe you, old man, can give me a herb for grumbling, and you, Ibn Sina, can teach it to read?\nBoth sages laughed, their laughter like the chime of two streams merging into a river. Ibn Sina rolled up his scroll, and Ibn Arabi rested a hand on his staff.\n— Your soul, Abu Bakr, — said the Sufi, — is not empty but awaits the pen that will write Allah’s name upon it. And your machine is mended not with herbs but with patience.\n— Patience, you say? — Abu Bakr muttered, sheathing his dagger. — That’s worse than sand in my boots.\nIbn Sina added:\n— And I’ll give you advice, O warrior: if your body is sound, your soul will find its way. Science and mysticism are like light and shadow—together, they reveal the whole.\nThus, beneath the mosque’s arches, their conversation flowed like a river nourishing an oasis. Ibn Sina shared his knowledge of the material world—of stars following the laws of *al-jabr* and the body governed by the balance of humors. Ibn Arabi spoke of the inner world—of the soul seeking unity with the Divine through mystical insight. They agreed and debated, but both saw in this dance of ideas a reflection of a truth beyond words."
    },
    {
        "title": "Chapter 19",
        "content": "Night draped the mosque in silence, broken only by the whisper of wind gliding between the minarets. Ibn Sina, Ibn Arabi, and Abu Bakr sat by a fire kindled in the courtyard, its flickering light dancing on their faces. The sage unrolled a map—a worn parchment etched with lines of rivers, mountains, and deserts—and pointed to two paths leading to the emir’s palace.\n— Here, — Ibn Sina began, tracing a finger along the desert’s edge, — is the long path. It winds through oases and caravan trails, as safe as a camel’s shadow at noon. Merchants have trodden it for centuries, and the way is worn by their steps. But it will take you two weeks, perhaps more, if sandstorms rise.\nThen he shifted his gaze to another route—a dark streak plunging into the dense forest east of the city.\n— And this is the short path. Through the forest, you’ll reach the emir in five days, if fortune favors you. But know this: that thicket is no place for the faint-hearted. People whisper of an inexplicable evil roaming there. Many have entered its canopy, but few returned. Those who did spoke of shadows stirring without wind and voices calling their names in the night.\nAbu Bakr, until then lazily warming his hands by the fire, sat up and slapped his thigh.\n— The desert?! Not a chance I’ll set foot there again! Sand in my boots, sand in my throat, sand in my eyes—I’ve had enough of that cursed dust! I’d sooner gut a camel with my saber than see another dune. The forest, you say? Well, shadows and voices are no worse than snakes and mirages. I’ll take the thicket!\nIbn Arabi, lost in thought, nodded, though a shadow of unease flickered in his eyes.\n— The forest… — he said softly. — If Allah guides us there, then an ordeal awaits. I trust in His protection, and my brother’s strength, — he glanced at Abu Bakr, — has saved us before. We’ll take the short path.\nIbn Sina frowned but did not argue.\n— Your will is your fate, — he said, rolling up the map. — But tread carefully. The forest forgives no carelessness. Take provisions—water, dates, bread—and keep your hearts open to signs. If evil truly lurks there, it is older than sand and craftier than the wind.\nAt dawn, as the first rays gilded the mosque’s dome, the travelers gathered their meager belongings. Ibn Sina saw them to the city gates, handing them a leather waterskin and a bundle of dried fruit.\n— May Allah protect you, — he said, clasping Ibn Arabi’s hand. — And remember, O Sufi: knowledge is a shield, but faith is a sword. And you, Abu Bakr, don’t hack at everything—the forest may strike back.\nAbu Bakr grinned, patting his saber.\n— If that forest tries to eat me, I’ll turn it into firewood! Farewell, sage, and pray we return with stories, not curses.\nIbn Arabi nodded, and they set off, leaving the city behind. The path to the forest crossed sun-scorched plains, where grass grew in sparse patches and the horizon shimmered in the heat’s haze. By midday, a wall of trees loomed before them—dense, dark, like a curtain hiding the unknown. Tall trunks, draped in moss, stretched skyward, their canopies woven so tightly that light barely pierced through, dappling the ground with patches of shadow.\nThey paused at the forest’s edge, and a sudden chill ran through them—not wind, but something else, as if the breath of an unseen gaze brushed their backs. Abu Bakr shuddered, shaking off the feeling, and snorted.\n— Ha! What’s this, old man? Jinn lining up to greet us? Or is the forest just saying “welcome”?\nIbn Arabi gripped his staff, his eyes scanning the dark gaps between the trees.\n— Not jinn, — he replied quietly. — A warning. There’s a power here, ancient and alive. But we chose this path, and Allah is with us. Step forward, my brother.\nAbu Bakr spat on the ground, adjusting his saber at his hip.\n— Well, if something jumps out, I’ll cut it down before it can say *Allah Akbar*. Let’s go, old man, don’t stand there like a tethered camel.\nThey shook themselves, as if casting off an invisible web, and stepped into the thicket. The shadows closed over them, swallowing the sunlight. The air grew heavy, thick with the scent of dampness, moss, and something sharp, almost alive. Twigs crunched underfoot, and somewhere in the distance, a sound echoed—perhaps a bird’s cry, perhaps the wind’s whisper—but it made them freeze for a moment. The forest embraced them, and with each step, it became clearer: there was no turning back."
    },
    {
        "title": "Chapter 20",
        "content": "The forest closed around Abu Bakr and Ibn Arabi, as if embracing them in its grip. Shadows wove between the trees, too dense, too alive to be mere plays of light. The air grew heavy, thick with dampness and something elusive—perhaps the scent of rotting leaves, perhaps the breath of a hidden presence. Silence hummed, broken only by the occasional snap of twigs and sounds that might have been the wind—or something else. They had been walking for an hour when the forest began its strange game.\nAt first, it was subtle: a rustle behind them, as if someone crept in their wake; faint laughter dissolving into the foliage; a glint of eyes in the dark—beast or mirage. Abu Bakr halted, his hand resting on his saber.\n— Hear that, old man? — he said, grinning, though a hint of unease crept into his voice. — Seems the forest wants to play with us. Or did your jinn from that pot escape here?\nIbn Arabi frowned, tightening his grip on his staff. His gaze darted to the shadows stirring among the trunks.\n— It’s not a jinn, — he replied softly. — Something is here. Something older than us. Stay sharp.\nBut the forest was in no hurry to reveal its secrets. As if teasing, it conjured a figure before Abu Bakr—a slender girl, her hair flowing like black silk, her eyes glowing with soft, beckoning warmth. She emerged from the darkness beneath a tree, smiled, and vanished, leaving behind a whisper that pierced the leaves:\n— Come to me, warrior… Here is peace…\nAbu Bakr froze, his face lit with a broad, almost childlike smile.\n— Ha! Did you see that, old man? What a forest! Maybe it’s not so evil after all—a beauty’s calling me! I’ll go check; maybe there’s water or something better!\nHe stepped forward, but Ibn Arabi grabbed his shoulder, his voice sharpening.\n— Stop, Abu Bakr! It’s an illusion. Don’t trust your eyes—the forest is toying with us.\nBut the whisper returned, closer, sweeter, enveloping the warrior’s mind like smoke from a fire.\n— Why listen to him, mighty one? I wait… There, in the cave… There is rest…\nAbu Bakr broke free, his eyes clouded, as if gazing through a veil of dreams.\n— Leave me be, old man! I’m no coward to fear every shadow. If it’s a trap, I’ll cut it down with my saber and be done!\nHe strode toward a cave’s gaping maw between the trees. The shadows around him quivered, thickened, as if invisible hands reached for him. Ibn Arabi froze, his heart gripped by a chill no forest dampness could explain. Something was wrong—not a jinn, not a beast, but something deeper, ancient, capable of clouding the mind and leading to oblivion. He whispered *dua*, seeking to understand what they faced, but the answer slipped away like a shadow from light.\nEntering the cave meant challenging the unknown, and fear—sharp as a blade—pierced his chest.\nAbu Bakr had already vanished into the darkness, his footsteps echoing off stone walls. The whisper grew louder, turning into a melody that drew him deeper. Ibn Arabi gripped his staff, his knuckles whitening. He could not abandon his brother, even if the forest harbored a force he didn’t know how to fight.\n*“Allah is with those who struggle against themselves,”* he recalled, and stepped toward the cave, banishing doubt.\nAt the entrance, a figure met him—not of flesh but of stone, carved by time, with eyes glowing a dull green fire. Its voice rumbled like distant thunder:\n— Name the answer, traveler, or turn back. I stand before you, but you do not see me. I can halt a king, yet wield no sword. My walls are thinner than air, stronger than stone. What am I?\nIbn Arabi paused, his breath catching. But his mind, honed by years of reflection, sought the key. He closed his eyes, listening to the cave’s silence, and answered:\n— Fear.\nThe stone shuddered, a grating sound echoed—the slab parted like gates, revealing a path into darkness. Ibn Arabi stepped inside, his heart steady but his soul braced for what the shadows hid. Deep within, Abu Bakr stood before the same figure—her beauty now blazed brighter, her skin gleaming like moonlight, her eyes beckoning like bottomless pools. She extended her hands, and he, entranced, stepped closer, his saber slipping from his weakened grip, clanging against stone.\nBut Ibn Arabi was near, and the cave’s darkness stirred, sensing his presence. Something waited ahead—vague, alive—and the forest, it seemed, held its breath."
    },
    {
        "title": "Chapter 21",
        "content": "The darkness of the cave thickened, alive, enveloping everything in a clammy chill. Faint light seeped through cracks in the stone ceiling—dim, like the last gasp of day—and in its flicker, Ibn Arabi saw her. The one who seemed a girl now revealed her true nature: a shadow-witch, her form flowing like smoke, her eyes blazing red, cutting through the gloom. She reached for Abu Bakr, and shadows, like tendrils, began to coil around him, drawing him into the void. The warrior stood motionless, his saber at his feet, his face blank, as if his mind had fled his body.\nIbn Arabi gripped his staff, his heart trembling with dread, but he steeled his will. His voice, at first quivering, grew firm as he recited Surah Al-Falaq, the 113th chapter of the Quran, its words sparking in the darkness like embers:\n— *Kul a’udhu bi-Rabbi-l-falaq, min sharri ma khalaq…*\nWith each word, the witch froze, her shadows quivering as if meeting an invisible wall. She let out a low, growling sound, full of rage, but for a moment, her power waned. Abu Bakr blinked, as if waking from a deep sleep, his hand instinctively darting to his saber. He seized the weapon, sprang to his feet, and lunged forward with a shout:\n— Ha! Whatever you are, I’ll cut you down like a snake in the desert!\nBut the witch was no mere shadow. Her form shimmered, melted, and swelled into a massive monster—hulking, hunched, its skin black as pitch, its red eyes glowing dimly, casting an eerie gleam on the cave walls. Its claws scraped against stone, and its maw opened, releasing a whisper that chilled the blood. Abu Bakr swung his saber, but the blade passed through it like smoke, and the monster only laughed—low, hollow, shaking the air.\nIbn Arabi stood petrified, fear chaining him like iron. The sight of this creature—not a jinn, not a beast, but an embodiment of darkness itself—froze him. But he recalled Allah’s words: *“There is no power but His power.”* Overcoming himself, he cast aside doubt, stepped forward, and raised his voice, invoking the protection of the Almighty. He began reciting Ayat al-Kursi, Surah Al-Baqarah, 2:255, its words resounding like thunder in the silence:\n— *Allahu la ilaha illa Huwa-l-Hayyu-l-Qayyum…*\nLight—invisible yet tangible—flared around him, flooding the cave like a wave. The witch howled, her red eyes squeezing shut in pain, and the shadows sustaining her began to crack and tear like worn cloth. Abu Bakr, blinded by the radiance, staggered back, shielding his face but still swinging his saber, shouting:\n— Begone, creature! Vanish back to your darkness!\nThe monster shrank, its form melting, dissolving in the light emanating from Ibn Arabi’s words. But before vanishing, the witch leaned forward, her voice—now faint, almost human—whispering cryptic pleas:\n— Forgive me… I didn’t want to… He forced me… The light will return…\nWith her final word, she erupted in blinding light that flooded the cave for a moment, forcing the travelers to shut their eyes. When they opened them, the darkness had lifted. The cave was empty—no shadows, no monster, only a faint ray of sunlight piercing a crack in the ceiling, illuminating the dusty floor.\nAbu Bakr, panting heavily, leaned on his saber.\n— Ha… Old man, what was that? A jinn? Shaitan? Or did I eat too many dates?\nIbn Arabi sank to his knees, still clutching his staff. His face was pale, but his eyes shone with calm.\n— I don’t know, my brother… But Allah saved us. Her last words… They’re not of this world. There’s more here than we can see.\nAbu Bakr snorted, sheathing his saber.\n— Let it stay hidden, as long as it doesn’t come at me with red eyes again! Let’s get out of here, old man, before the forest cooks up another trick.\nThey left the cave, leaving its darkness and secrets behind. The forest’s light, though dim, felt brighter than the sun after that gloom. But the witch’s words—pleas for forgiveness and a hint of “him”—echoed in their ears, promising that their trials were far from over."
    },
    {
        "title": "Chapter 22",
        "content": "After the battle in the cave, the forest seemed to exhale, releasing some of its gloom. Abu Bakr and Ibn Arabi emerged from the stone walls, leaving behind the shadows and the witch’s whispers, her final words still ringing in their ears. The sun dipped toward the horizon, and the travelers decided to make camp among the trees. They found a small clearing encircled by gnarled trunks, where soft moss carpeted the ground and faint light filtered through the canopy, tracing golden threads across the earth.\nAbu Bakr tossed his pack to the ground and collapsed beside it, rubbing his shoulder.\n— Well, old man, if this forest tries to eat me again, I’ll chop it down to the last shrub! What was that thing in the cave? A jinn? Shaitan? Or should I swear off dates?\nIbn Arabi sat by the fire, kindling it with flint. His face was pensive but calm.\n— I don’t know, my brother. Her words… “He forced me.” There are more mysteries here than we can unravel. But Allah granted us victory, and while we live, the path remains open.\nThe fire crackled, casting sparks into the deepening twilight. For the first time that day, it felt as though the forest had loosened its grip. But it was merely a lull before a new game.\nAt night, as the moon rose above the trees, strange things began around the camp. First, Abu Bakr’s waterskin vanished—he’d left it by his pack, but moments later, it hung from a branch above his head. Then a clear, crystalline giggle, light as tinkling glass, echoed from the darkness and faded. Abu Bakr sprang up, his saber flashing in his hand.\n— Who’s there?! Show yourself, or I’ll cut you down, shadow or beast!\nAnother laugh answered, now from a different direction. Tiny shapes darted between the trees, too swift to discern. The cricket chirping peacefully by the fire fell silent, only to resume its song deep in the forest. Abu Bakr spun, trying to track the movement.\n— Ha! What’s this, forest rats? Or jinn playing games? Come on, old man, say your prayers—I’m catching one of these!\nHe lunged toward a tree where he’d seen a glint of light, grabbing at the air—but his fingers closed on nothing. A giggle sounded behind him, and turning, he saw his own cloak soar onto a branch, as if tossed by an invisible hand. Abu Bakr growled, leaping again—and missing once more.\n— Curse it! They’re mocking me! Old man, this is worse than sand in the desert!\nIbn Arabi, silent until now, rose, peering into the dark. His ears caught a melody in the giggles—not malicious, but mischievous, like children playing hide-and-seek. He recalled ancient tales of *Hurus al-Jann*—offspring of jinn and humans, nature spirits dwelling in forests and springs, teasing travelers but rarely causing harm. The Sufi stepped forward and spoke, his voice gentle yet firm, woven with old verses:\n— *As-salamu alaikum*, O children of the unseen world! We are not your enemies. Show yourselves, as stars reveal themselves in the night, and let there be peace between us.\nThe shadows froze. The giggles hushed, and the forest held its breath. Then, from the gloom, figures emerged—small, no taller than children, their bodies shimmering like fireflies, their eyes gleaming like stars in a moonless sky. Their faces vaguely resembled humans, but their features shifted, as if molded from mist. One, the boldest, hopped closer, clutching Abu Bakr’s waterskin, and laughed brightly.\n— You’re funny, big man! — it squeaked, tossing the waterskin into the air and catching it. — Why cut? We’re not shadows, we’re friends!\nAbu Bakr lowered his saber, his eyes narrowing suspiciously.\n— Friends, you say? Then who threw my cloak into a tree? If you’re friends, give me water and stop hopping around like fleas!\nIbn Arabi smiled, lowering his staff.\n— They are *Hurus al-Jann*, my brother. Children of jinn, born of nature. They mean no harm, only love to play. Tell us, little one, why are you here?\nThe spirit holding the waterskin tilted its head, its eyes flashing brighter.\n— We’ve always lived here. The forest is our home. You defeated the darkness in the stone, and we watched. Now we’re curious. Are you walking to light or to new shadows?\nAbu Bakr snorted, sheathing his saber.\n— We’re heading to the emir, kid, if the forest doesn’t eat us first! Got anything useful, or are you just good at stealing waterskins?\nThe spirit laughed and leapt onto the warrior’s shoulder. Abu Bakr flinched, but it was already whispering in his ear:\n— Go to the river, big man. There’s light, but the shadow is deeper. One of you will see truth, the other—lies. Don’t trust all that shines.\nWith that, it hopped down and vanished like a spark, the others dissolving after it, leaving only an echo of laughter and a faint breeze. The waterskin dropped at Abu Bakr’s feet, and his cloak fell from the branch onto his head.\n— Ha! What pests! — he grumbled, shaking off the fabric. — “To the river,” they say. And where’s this river? Old man, did you make sense of their chatter?\nIbn Arabi gazed where the spirits had vanished.\n— They gave us a clue, — he said softly. — The river… Light and shadow… It’s a trial, my brother. We press on, but with caution. The forest hasn’t finished its games.\nThey settled by the fire, but sleep came uneasily. The *Hurus al-Jann*’s giggles faded, but the forest whispered around them, and the little spirit’s words—“one will see truth, the other—lies”—hung in the air, a promise of a new enigma."
    },
    {
        "title": "Chapter 23",
        "content": "Four days separated Abu Bakr and Ibn Arabi from the emir’s palace, and the forest, as if sensing their haste, conjured new riddles. Following the whisper of the *Hurus al-Jann*, they reached a river—narrow but swift, hidden in the heart of the thicket. Its waters gleamed with crystalline clarity, reflecting the rare sunlight that pierced the canopy. Yet beneath the surface, the shadows seemed too deep, almost bottomless, as if the river were not merely a stream but a gateway to another realm.\nAbu Bakr stepped to the bank, peering into the water.\n— Ha! Here’s the river! — he exclaimed, slapping his thigh. — The little pests told us to come here, and what? Water’s water. We cross it, and we’re closer to the emir. Four days, old man, just four days left!\nIbn Arabi nodded, but his gaze lingered on the shadows beneath the surface. Something stirred within them—not fish, not the current, but something alive, beckoning. He gripped his staff, feeling a chill of foreboding.\n— Be cautious, my brother, — he said softly. — The *Hurus* warned us: light and shadow run deeper here. Not all is as it seems.\nAbu Bakr snorted, already wading into the water.\n— Shadows, light… You see jinn in every puddle! Come on, old man, or I’ll carry you over my shoulder!\nThey stepped into the river, and the water, cold as the breath of night, embraced their legs. But as it reached their knees, an unseen force yanked them downward—sharply, as if clawed hands had seized their ankles. Abu Bakr cried out, Ibn Arabi gasped, and in the next moment, the river swallowed them, dragging them into its murky depths.\nBeneath the surface, the world changed. Darkness enveloped them, but not absolute—something golden flickered within, distant and alluring, like a star fallen to the riverbed. An artifact—perhaps a goblet, perhaps a lamp—glowed, promising wealth and power. Abu Bakr, a warrior to his core, surged toward it, cutting through the water with powerful strokes. His eyes blazed with greed, his saber dangling uselessly at his hip in this abyss.\nIbn Arabi, swimming beside him, realized: it was an illusion. The light was too perfect, too enticing, like a desert mirage. He tried to shout, but the water muffled his voice, and only bubbles escaped his lips. Desperate, he grabbed Abu Bakr’s shoulder, forcing him to pause, and pointed to their reflections trembling in the water, illuminated by the golden glow.\nIn the reflection, Ibn Arabi’s double began to speak—its lips moved, though he himself was silent. A voice, soft and clear, pierced Abu Bakr’s mind:\n— *Do not trust all that shines. Reality is not here. Pain is your guiding star.*\nAbu Bakr froze, his hand hovering an inch from the golden light. He turned to Ibn Arabi, his eyes narrowing with doubt. The warrior wavered, the pull of the artifact clashing with the warning, but the illusion held fast. Ibn Arabi knew words alone wouldn’t suffice. Gathering all his strength, he drove a sharp fist into Abu Bakr’s chest—straight into his solar plexus. Pain seared through the warrior, shattering the enchantment.\nThe water quivered, like glass struck by a blow, and the depths vanished. In an instant, they stood in the river—the water barely reached their knees, the current babbled peacefully, and the golden light was gone, as if it had never been. The shadows beneath the surface dissolved, leaving only ordinary stones and weeds. Silence enveloped them, broken only by the whisper of wind in the leaves.\nAbu Bakr coughed, rubbing his chest, and shot Ibn Arabi a furious glare.\n— Ha! Have you lost it, old man?! Why’d you hit me? I was *this close* to grabbing that thing—it might’ve gotten us to the emir faster!\nIbn Arabi shook his head, breathing heavily.\n— It was a lie, my brother. The *Hurus* said: one will see truth, the other—lies. You saw the shine, I saw the deception. Pain brought you back.\nAbu Bakr spat into the water, still grumbling, but a hint of gratitude flickered in his voice.\n— Pain, you say? Well, if it’s my star now, then you’re my eternal guide with fists. Let’s go, old man, four days won’t wait.\nThey clambered onto the bank, shaking out their sodden cloaks. The river lay behind, calm and innocent, but its whisper lingered in their ears, a reminder of how close they’d come to the edge. The forest watched in silence, and ahead awaited new shadows—or perhaps new light."
    },
    {
        "title": "Chapter 24",
        "content": "The river lay behind, but its chill clung to the sodden cloaks of Abu Bakr and Ibn Arabi, dripping icy beads from the fabric. Before they could shake off the damp, the sky unleashed a torrent—sharp, piercing rain with a wind that lashed like a whip. They pressed on without pause, though their clothes stuck to their skin, and the forest thinned, revealing a wide meadow. In its center stood a house—solitary, old, with a sagging roof and a window where the warm glow of a candle flickered. The scent of fresh bread wafted through the air, soft and inviting, promising shelter from the bleak night.\nAbu Bakr, teeth chattering, nodded toward the house.\n— Ha! Look, old man! Warmth, bread—better than this cursed rain! Four days to the emir, and I’m not freezing like a camel in a storm. Let’s go!\nIbn Arabi hesitated, peering at the light. A pang of unease, sharp as a thorn, pricked his heart, but the wind struck harder, and he relented.\n— Very well, my brother. But be wary. The forest offers no refuge without a price.\nThey crossed the threshold, and the door creaked, admitting them into a warmth—too thick, too alive for an empty house. The hearth blazed without logs, a warm loaf of bread lay on the table, as if someone had just left. Abu Bakr reached for it, but the door slammed shut with a deafening crash. There was no lock, yet it wouldn’t yield—not to blows, not to shoves.\n— What devilry is this? — Abu Bakr roared, throwing his shoulder against the wood. — Old man, it’s a trap!\nIbn Arabi turned, but his words died as the walls shuddered, as if drawing breath. The candle’s light flickered, shadows in the corners came alive, stretching like a web, and the house hummed—low, guttural. It was no structure but a creature, its walls pulsing, feeding on their fears, gnawing doubts from the depths of their souls.\nAbu Bakr broke first. From the shadow by the hearth, figures emerged—his fallen comrades, gray, with hollow eyes and mouths twisted in reproach. One, a bloody gash across his chest, stepped closer.\n— You abandoned us, Abu Bakr, — he rasped. — Your saber could’ve saved us, but you fled. We rotted because of you.\nAbu Bakr stumbled back, his hand trembling on his saber’s hilt.\n— Lies! I fought! It wasn’t me…\nBut the shadows thickened, and another figure appeared—a girl, beautiful as a dream. Her eyes shone like stars, her hair flowed like silk, her voice sweet as honey. She was the stranger from his dreams, beckoning him in the night, promising a love he’d never known.\n— You could’ve saved me, Abu Bakr, — she whispered, her spectral hand brushing his chest. — But you chose war. I died calling for you, and you didn’t come.\nAbu Bakr groaned, his saber slipping from his grasp, clanging to the floor.\n— No… I didn’t know… Who are you? I would’ve…\nThe house’s laughter—low, resonant—shook the walls, feeding on his turmoil. The girl smiled, but her smile turned sharp as a blade, her eyes darkening into bottomless pits.\nIbn Arabi had no time to intervene—his own darkness stirred. From the shadows by the table, voices rose—his old teachers, whose words once scorched his soul. Their gaunt figures loomed, robed, their eyes brimming with contempt.\n— You’re a fool, Ibn Arabi, — one hissed, his voice dry as a curled scroll. — You seek truth but are blind. Your visions are madness, your wisdom a lie.\nBut the shadows deepened, and from them stepped his father—tall, with a gray beard and the kind eyes Ibn Arabi remembered from childhood. Now those eyes were dead, his chest gaping with a wound. He fell to his knees, coughing blood, and rasped:\n— You didn’t save me, son… I died while you chased your truths. You abandoned me for empty words.\nIbn Arabi staggered, his staff trembling in his hands. Pain gripped his chest, ancient as the world—guilt he carried, unacknowledged.\n— Father… I couldn’t… Forgive me…\nThe voices swelled, blending into a cacophony that tore at their minds. The house fed on their horror, and the shadows warped further. Abu Bakr turned—and saw not Ibn Arabi but a demon in a black cloak, eyes blazing, a dagger dripping blood. Ibn Arabi saw Abu Bakr—but not his friend, a beast with a crimson grin, his saber smeared with his father’s blood. They raised their weapons against each other, and the house thrummed with delight, its walls quaking as if laughing.\nBut in this inferno, Ibn Arabi froze. The voices, faces, pain—it was all too loud, too real. He recalled the river, the reflection’s words: *“Pain is your guiding star.”* These were no enemies but their own souls. He lowered his staff and shouted, cutting through the din:\n— Abu Bakr! It’s not me! It’s our fear! Don’t strike—embrace it!\nAbu Bakr, saber raised, paused. Rage in his eyes battled something deeper. He clenched his teeth, lowered his blade, and rasped, facing the shadows:\n— I’m no coward… I’m no traitor… You’re dead, and I’m not to blame… And you, — he turned to the girl, her beauty now fading, — you’re a dream, not truth. I couldn’t save what never was.\nThe shadows of his comrades and the stranger quivered, dissolving like smoke in the wind. Ibn Arabi stepped to him, placing a hand on his shoulder, and spoke, facing his father:\n— I’m no fool… Truth lies in Allah, not your words. Father, I couldn’t save you, but I carry your love, not guilt.\nHis father’s figure smiled—faintly, warmly—and vanished, as did the teachers. The house shook, its walls cracking, the candle’s light snuffing out. The air grew heavy, then fell silent. The door swung open on its own, and they stumbled out.\nThe rain had stopped. The meadow was empty—no house, no light, no bread. Only the wind stirred the grass, and the sky above cleared, revealing stars. Abu Bakr collapsed to his knees, panting.\n— Ha… Old man, what was that? Shaitan? A jinn? Or have I truly lost my mind?\nIbn Arabi sat beside him, his face pale but his eyes clear, as if washed by tears.\n— It was the house of our souls, my brother. It drew out our darkness and showed it to us. We triumphed not by strength but by truth.\nAbu Bakr snorted, but his voice wavered.\n— Truth, you say? If it’s this bitter, I’ll stick to my saber… But that girl… and my brothers… Damn it.\nThey sat in silence, gazing at the stars. Four days to the emir, but they were changed—purified by pain, bearing wounds unseen but deep as the river they’d emerged from."
    },
    {
        "title": "Chapter 25",
        "content": "After the nightmares of the sinister house, the forest seemed to take pity on Abu Bakr and Ibn Arabi, offering them refuge. The rain ceased, and a few steps from the empty meadow, they stumbled upon a small, abandoned hut—its walls darkened by time but cozy, like a nest in a storm. The roof was intact, and inside, it smelled of dry wood and old moss. A pile of straw lay in the corner, and the hearth held remnants of long-cold coals. It was no palace, but after the cold and darkness, it felt like a gift from the heavens.\nAbu Bakr dropped his pack on the floor and collapsed onto the straw, stretching out his legs.\n— Ha! Finally, something normal! Four days to the emir, old man, and I’m glad this forest gave us one night without jinn or shadows.\nIbn Arabi smiled, settling by the hearth. He kindled a fire, and soon a faint flame crackled, casting warm glows on their faces. They sat in silence, listening to the rustle of leaves beyond the walls, until fatigue and warmth loosened their tongues.\nAbu Bakr spoke first, staring into the fire.\n— You know, old man, I wasn’t always like this—wandering forests with you. Once, I was an elite warrior of the emir. His campaigns… Oh, those were days! Blood, glory, the clash of sabers—I lived for it. We took cities, crushed enemies, and the emir rewarded me with an estate. A fine place—garden, stables, quiet. But the war ended, and I… I got bored. Quiet’s worse than sand in your throat. I was made for battles, not peace.\nHe paused, fidgeting with his cloak’s edge, and added softly:\n— And that girl… from the house. I’ve seen her in dreams for years—beautiful as a star, calling me. I used to think of marrying, finding someone, but… I’m scared, old man. Responsibility, family—that’s not for me. What if I fail them? What if I can’t protect them? Better a saber than that.\nIbn Arabi nodded, looking at him with gentle warmth.\n— Your heart is a battlefield, Abu Bakr. You’re a warrior not just outwardly but within. Fear isn’t weakness—it’s a sign you have something to lose.\nHe tossed a branch into the fire, and the flames flared brighter. Now he spoke, his voice quiet but heavy with memory.\n— I had no gardens or glory. My father was poor—couldn’t afford the schools I dreamed of. I worked from childhood—carrying water, cleaning stables, anything to buy a single book. At night, I read by candlelight until my eyes watered. But then my father fell ill… gravely, for a long time. I cared for him, but deep down… — he faltered, swallowing hard, — I wished he’d die. Not out of malice, but exhaustion. I wanted to go to the big city, study, live. When he finally passed, I gained freedom, but with it—guilt. I repent every day, my brother, and pray Allah forgives me.\nAbu Bakr turned to him, his eyes serious, free of their usual mockery.\n— Ha… You wanted freedom, I wanted war. And here we are, both tormented. But you know, old man, I’m glad you’re with me. Without you, this forest would’ve eaten me—or I’d have hacked it to bits, which is worse.\nIbn Arabi smiled, placing a hand on his shoulder.\n— And I’m glad for you, my brother. Your strength has pulled us from darkness, and your soul is more honest than you think. We both carry pain, but together, it’s lighter. You fear family, yet you’ve already become my brother. And I… I’m learning to forgive myself through your faith in me.\nAbu Bakr snorted, but his voice held warmth.\n— Brother, you say? Well, if I’m your brother, I’m the worst kind—grumbling, with a saber. That girl from my dreams… Maybe she’s out there, waiting. But for now, it’s just you, old man, and this damned forest.\nThey fell silent, gazing into the fire. Abu Bakr offered Ibn Arabi advice, rough but sincere:\n— Stop punishing yourself for your father. He’d want you to live, not carry his death on your shoulders.\nIbn Arabi replied softly:\n— And you, my brother, don’t fear what you don’t know. Family isn’t chains—it’s strength, like our bond.\nThe fire dwindled, and they lay on the straw, each lost in thought. Abu Bakr saw the girl’s face in the darkness, but now it was gentler, without reproach. Ibn Arabi recalled his father—his smile, not his wound. The forest whispered beyond the walls, but the hut guarded their peace. Four days to the emir, and this night became their anchor—simple yet profound, like their connection."
    },
    {
        "title": "Chapter 26",
        "content": "Night draped the abandoned hut in a soft veil, and exhaustion finally claimed its due. Abu Bakr fell asleep, curled on the straw, his breathing steady as the rhythm of a distant drum. Ibn Arabi lay beside him, watching the dying fire until his eyelids grew heavy, and he sank into a sleep—deep, boundless, like the river that nearly swallowed them earlier that day.\nHe awoke in another realm. Before him stretched a fantastical world: a waterfall whose waters flowed not downward but upward to the sky, shimmering silver and gold, as if woven from starlight. The surrounding rocks were cloaked in moss that glowed a soft blue, and the air hummed with silence, broken only by the whisper of water. Ibn Arabi stepped forward, sensing this was no mere dream but an infinite void where his soul met something greater.\nAt the waterfall’s edge stood a man—lean, in an orange robe, with a shaved head and a serene face. His eyes were closed, but he turned to Ibn Arabi, as if long expecting him.\n— Peace be upon you, wanderer, — he said, his voice gentle as wind over sand. — I was meditating in the void, and here you are. Who are you?\nIbn Arabi bowed, feeling a strange kinship.\n— I am Ibn Arabi, a Sufi seeking God. And you?\n— I am a monk, walking the path of the Buddha, — he replied, opening eyes clear as a mountain stream. — We’ve met where boundaries cease. Sit, let us speak.\nThey sat on a flat stone, and the waterfall’s hum softened, as if listening. Ibn Arabi began:\n— You say the world is an illusion, like a dream. But are we not given reason to discern truth from falsehood? Does God not guide us on a path to know Him?\nThe monk smiled, gazing at the upward-flowing waters.\n— Truth eludes those who chase it. Cling to forms, and you lose the essence. Do you not say God is everywhere? Then where is the line between reality and illusion?\nIbn Arabi pondered, watching the moss flare brighter.\n— God is everywhere, yes. But I see the world as a mirror of His light. We don’t vanish in illusion—we reflect Him. You seek emptiness, dissolving your ‘self.’ Is that not a loss of the gift of consciousness He gave us?\nThe monk swept his hand through the air, and a faint breeze rippled over the waterfall.\n— There is no fixed ‘self’ in this world. It’s like a river—you see it now, but is it the same water as a moment ago? I don’t lose—I let go. You make yourself a mirror—but who gazes into it?\nAt that moment, a bird—white, with wings gleaming like pearls—soared from the waterfall, letting out a sharp cry. Ibn Arabi saw it as a sign from Allah, the monk as a symbol of freedom. They exchanged glances, and the Sufi continued:\n— Love for God is my path and my goal. It burns away barriers between me and Truth. How do you escape suffering?\nThe monk looked at the sun, slowly rising over the horizon, painting the waters crimson.\n— Suffering comes from attachment. Accept all as it is, and pain vanishes. Is your love not attachment?\nIbn Arabi smiled, soft as moonlight.\n— Love doesn’t bind—it frees. It’s a fire that purifies, not chains that hold.\nA fire—invisible yet tangible—flared at their feet, fading as swiftly as it appeared. Each saw meaning in it: for Ibn Arabi, Divine light; for the monk, the fleeting nature of existence. The monk nodded.\n— We pray five times a day, — said Ibn Arabi, — and in that rhythm lies harmony with His order. Your meditation?\n— It does nothing, — the monk replied. — It is. In silence, the divide between me and the world fades. You hear God in words; I hear Him in stillness.\nThe waterfall slowed, and the silence deepened. They sat, gazing at it, and Ibn Arabi felt their paths—distinct yet kindred—intersect in this void. But the dream wavered as the white bird returned, a folded leaf in its beak. It dropped it at Ibn Arabi’s feet and flew off. The Sufi unfolded it—Arabic script, words from the Quran: *“Indeed, with hardship comes ease”* (94:6). The monk glanced at it and nodded, as if seeing his own text.\n— A sign, — said Ibn Arabi. — Our path is not an end, but a continuation.\n— Mine too, — said the monk. — We tread different trails, but to the same silence.\nThe dream began to fade. The waterfall dissolved, the rocks dimmed, and the monk’s voice became a whisper:\n— Will we meet again, wanderer?\n— In the void, yes, — Ibn Arabi replied, and the world vanished.\nHe opened his eyes in the hut. The fire had died, dawn seeped through the cracks. Abu Bakr still slept, snoring softly. Ibn Arabi touched his chest, feeling the warmth of the dream. Four days to the emir, but now he carried something new—not an answer, but a question, leading him deeper toward Allah."
    }
    
]
