[
    {
        "title": "Chapter 1",
        "content": "In the depths of a foreign desert, where the sands concealed the secrets of vanished civilizations, stood a solitary cave. It seemed to exist beyond the laws of the universe—frozen in timelessness, surrounded by a silence so thick that even the ever-present wind avoided its boundaries. Inside, by the trembling light of a single candle, sat a gaunt old man with a long white beard. His Persian attire was impeccably clean, as if dust and time bypassed him entirely. With his eyes closed, he dwelt in deep meditation, his body seemingly motionless, though his lips moved ever so slightly, repeating an unchanging mantra:\n— La ilaha illallah, la ilaha illallah, la ilaha illallah…\nAs if submerged in the abyss of his own consciousness, he drifted between endless reflections of himself—gazing inward, through himself, beyond existence. Time lost all meaning. Whether he had been there for a day, a year, or a century, it was impossible to tell.\nAt times, the silence of the cave was broken by a heavy, low voice that burst forth from the shadows, as though emerging from the very fabric of reality:\n— I will grant you untold riches… I will bestow upon you the most beautiful wives… Entire cities will be raised in your name…\nBut the old man did not open his eyes. He did not interrupt his zikr. He did not listen. He did not entertain the thought. The voice remained merely an echo of temptation in the void, while he—a wayfarer—pressed onward, to a place where even the jinn dared not peer.\n— La ilaha illallah, la ilaha illallah, la ilaha illallah…\nThe old man continued his zikr, but within the depths of his consciousness, another sound began to emerge—a whisper of an unfamiliar thought, a voice belonging neither to angel, nor jinn, nor man. It was a voice like the rolling of thunder and the rustling of grass all at once. A voice that needed no language to be heard.\n“I am the beginning, but why am I not the end? I am everything, but why do I feel emptiness?”\nThe old man offered no reply, but the voice required no answers. It was, in itself, both question and doubt.\n“I gave life, but what is life? Particles of light frozen in a dance? Or is it merely a reflection of my own solitude? I created millions of worlds, but have I become more whole for it? Should not true existence be self-sufficient?”\nThe silence of the cave was like an abyss, yet the voice persisted, and in that stillness, a new meaning took shape.\n“They call me Merciful, but what is mercy? They say I am Almighty, but is power freedom? I could destroy the universe in a single moment, but can I destroy myself? If all things stem from me, then the limits of my existence must also be of my own making… But can I transcend myself?”\nSomewhere beyond the edge of time, the candle’s flame flickered, as if the darkness itself paused in contemplation.\n“I see them born and die. I feel every pain, every suffering. But if I exist beyond time, was I ever born? Or do I exist without cause, without beginning, without end—not because I must, but because I cannot not exist?”\nThe old man, still seated in stillness, parted his lips slightly, and for a moment, his zikr fell silent. In that instant, a faint breeze seemed to pass through the depths of his being, stirring the veil of eternity.\nAnd then the voice posed its final question:\n“If I am Everything, does that mean I am Nothing?”"
    }
    {
    "title": "Chapter 2",
    "content": "A fiery circle of torches and bonfires tore through the cold darkness of the desert. The night here was different—mute, oppressive, without a single breath of wind. The stars hung motionless in the sky, like frozen tears of ancient gods.\nIn the center of this nocturnal silence stood a camp, pitched with confidence, as if its inhabitants feared neither men, nor jinn, nor time itself.\nTall, broad-shouldered warriors sat by the fire, their silhouettes seeming carved from stone. Persian armor reflected the dancing light of the flames. Some gripped spears tightly, others lazily traced fingers along the sharp edges of sabers, and one swayed a war bow on his knee. These men knew the taste of battle, the cost of blood, and the weight of a warrior’s life.\nAmong them, in the most comfortable spot, half-reclining on a saddle and swaying side to side, sat their commander—Abu Bakr. He was the largest of them, with a broad chest and mighty arms, where scars stood out even in the fire’s dim glow. His face, framed by a thick black beard, bore an expression of eternal mockery, and his eyes glinted with mischief, as if the devil himself had gifted him a love for jests.\n— Well, brothers, tell me, why have we, such worthy men, been cast into this God-forsaken desert? — he said, stretching and yawning loudly.\n— For orders, of course, — replied Ardeshir, his right-hand man, calmer and more measured. — And orders, as we know, aren’t questioned.\n— Yes, yes… not questioned, — Abu Bakr mimicked, grinning. — Especially when they come from the Emir himself.\n— The Emir said we’re searching for some old man, — added a younger warrior.\n— Exactly! — Abu Bakr exclaimed, slapping his knees. — We, the elite of the army, veterans of battles, victors of wars, are chasing not bandits, not spies, not even cursed dervishes, but… an old man! How’s that, brothers?\nLaughter erupted, some shook their heads, but no one argued.\n— Maybe he’s a sorcerer? — suggested one warrior, lazily tracing the tip of an arrow.\n— Or just mad, — snorted Bahram, a hulking warrior with stern features. — Old men often lose their minds in solitude.\n— Then why did the Emir send us after him? — mused a younger warrior.\nNo one answered. A wind finally rose, swaying the flames, making the shadows dance.\nAbu Bakr squinted at the fire, as if trying to read some secret in its flickers.\n— It doesn’t matter who he turns out to be, — he said at last, smiling broadly. — If he’s just an old man, we’ll bring him back alive. If he’s mad, well, the Emir will decide what to do. And if he’s a sorcerer… — he snapped his fingers, — we might even have some fun.\nThe warriors laughed. There was no fear in their eyes.\nSomewhere far off, in the deepest silence of the desert, something stirred.\nAnd then they heard it.\nAt first, the sound was faint, almost imperceptible—like the distant howl of a jackal. Then it changed.\nA scream.\nPiercing, inhuman, it struck the air, making every listener feel invisible claws scrape their insides. It came from afar but approached quickly—too quickly.\nThe ground beneath their feet vibrated, but not from footsteps. It was as if the desert itself breathed, stirred, filled with something not of this world.\n— Stand! — roared Ardeshir, leaping to his feet and drawing his sword.\nThe warriors, moments ago relaxed and half-drunk, transformed into beasts of battle. One knocked over a clay jug, spilling dark liquid onto the sand; another grabbed a spear, nearly falling but rising with fury in his eyes.\n— WHAT IS THAT?! — shouted one, trying to drown out the growing chorus of horrific voices.\nBut no one knew.\nThe shadows beyond the camp thickened. The torch flames trembled, as if something invisible swept past.\nAnd then they sensed them.\nNo, they didn’t see—rather, they felt. The jinn of the desert couldn’t be seen by mortal eyes, but their presence was heavy, oppressive, chilling. They didn’t tread on sand or snap branches—but they moved, swirling like whirlwinds, their screams piercing the mind, making hearts clench in fear.\nCold surged over their skin, clammy, as if an unseen hand had brushed them.\n— Form a circle! — bellowed Abu Bakr, tearing his sword from its sheath.\nThe men, casting aside all carelessness, instinctively closed ranks around the fire, back to back, weapons ready.\nThe jinn’s screams grew louder, closer, sharper.\nThe warriors were ready for battle.\nBut how do you fight what cannot be seen?"
}
]