[
    {
        "title": "Chapter 1",
        "content": "In the depths of a foreign desert, where the sands concealed the secrets of vanished civilizations, stood a solitary cave. It seemed to exist beyond the laws of the universe—frozen in timelessness, surrounded by a silence so thick that even the ever-present wind avoided its boundaries. Inside, by the trembling light of a single candle, sat a gaunt old man with a long white beard. His Persian attire was impeccably clean, as if dust and time bypassed him entirely. With his eyes closed, he dwelt in deep meditation, his body seemingly motionless, though his lips moved ever so slightly, repeating an unchanging mantra: La ilaha illallah, la ilaha illallah, la ilaha illallah… if submerged in the abyss of his own consciousness, he drifted between endless reflections of himself—gazing inward, through himself, beyond existence. Time lost all meaning. Whether he had been there for a day, a year, or a century, it was impossible to tell. times, the silence of the cave was broken by a heavy, low voice that burst forth from the shadows, as though emerging from the very fabric of reality: I will grant you untold riches… I will bestow upon you the most beautiful wives… Entire cities will be raised in your name…\nBut the old man did not open his eyes. He did not interrupt his zikr. He did not listen. He did not entertain the thought. The voice remained merely an echo of temptation in the void, while he—a wayfarer—pressed onward, to a place where even the jinn dared not peer.\n— La ilaha illallah, la ilaha illallah, la ilaha illallah…\nThe old man continued his zikr, but within the depths of his consciousness, another sound began to emerge—a whisper of an unfamiliar thought, a voice belonging neither to angel, nor jinn, nor man. It was a voice like the rolling of thunder and the rustling of grass all at once. A voice that needed no language to be heard.\n\"I am the beginning, but why am I not the end? I am everything, but why do I feel emptiness?\"\nThe old man offered no reply, but the voice required no answers. It was, in itself, both question and doubt.\n\"I gave life, but what is life? Particles of light frozen in a dance? Or is it merely a reflection of my own solitude? I created millions of worlds, but have I become more whole for it? Should not true existence be self-sufficient?\"\nThe silence of the cave was like an abyss, yet the voice persisted, and in that stillness, a new meaning took shape.\n\"They call me Merciful, but what is mercy? They say I am Almighty, but is power freedom? I could destroy the universe in a single moment, but can I destroy myself? If all things stem from me, then the limits of my existence must also be of my own making… But can I transcend myself?\"\nSomewhere beyond the edge of time, the candle’s flame flickered, as if the darkness itself paused in contemplation.\n\"I see them born and die. I feel every pain, every suffering. But if I exist beyond time, was I ever born? Or do I exist without cause, without beginning, without end—not because I must, but because I cannot not exist?\"\nThe old man, still seated in stillness, parted his lips slightly, and for a moment, his zikr fell silent. In that instant, a faint breeze seemed to pass through the depths of his being, stirring the veil of eternity.\nAnd then the voice posed its final question:\n\"If I am Everything, does that mean I am Nothing?\""
    },
    {
        "title": "Chapter 2",
        "content": "A fiery circle of torches and bonfires tore through the cold darkness of the desert. The night here was different—mute, oppressive, without a single breath of wind. The stars hung motionless in the sky, like frozen tears of ancient gods.\nIn the center of this nocturnal silence stood a camp, pitched with confidence, as if its inhabitants feared neither men, nor jinn, nor time itself.\nTall, broad-shouldered warriors sat by the fire, their silhouettes seeming carved from stone. Persian armor reflected the dancing light of the flames. Some gripped spears tightly, others lazily traced fingers along the sharp edges of sabers, and one swayed a war bow on his knee. These men knew the taste of battle, the cost of blood, and the weight of a warrior’s life.\nAmong them, in the most comfortable spot, half-reclining on a saddle and swaying side to side, sat their commander—Abu Bakr. He was the largest of them, with a broad chest and mighty arms, where scars stood out even in the fire’s dim glow. His face, framed by a thick black beard, bore an expression of eternal mockery, and his eyes glinted with mischief, as if the devil himself had gifted him a love for jests.\n— Well, brothers, tell me, why have we, such worthy men, been cast into this God-forsaken desert? — he said, stretching and yawning loudly.\n— For orders, of course, — replied Ardeshir, his right-hand man, calmer and more measured. — And orders, as we know, aren’t questioned.\n— Yes, yes… not questioned, — Abu Bakr mimicked, grinning. — Especially when they come from the Emir himself.\n— The Emir said we’re searching for some old man, — added a younger warrior.\n— Exactly! — Abu Bakr exclaimed, slapping his knees. — We, the elite of the army, veterans of battles, victors of wars, are chasing not bandits, not spies, not even cursed dervishes, but… an old man! How’s that, brothers?\nLaughter erupted, some shook their heads, but no one argued.\n— Maybe he’s a sorcerer? — suggested one warrior, lazily tracing the tip of an arrow.\n— Or just mad, — snorted Bahram, a hulking warrior with stern features. — Old men often lose their minds in solitude.\n— Then why did the Emir send us after him? — mused a younger warrior.\nNo one answered. A wind finally rose, swaying the flames, making the shadows dance.\nAbu Bakr squinted at the fire, as if trying to read some secret in its flickers.\n— It doesn’t matter who he turns out to be, — he said at last, smiling broadly. — If he’s just an old man, we’ll bring him back alive. If he’s mad, well, the Emir will decide what to do. And if he’s a sorcerer… — he snapped his fingers, — we might even have some fun.\nThe warriors laughed. There was no fear in their eyes.\nSomewhere far off, in the deepest silence of the desert, something stirred.\nAnd then they heard it.\nAt first, the sound was faint, almost imperceptible—like the distant howl of a jackal. Then it changed.\nA scream.\nPiercing, inhuman, it struck the air, making every listener feel invisible claws scrape their insides. It came from afar but approached quickly—too quickly.\nThe ground beneath their feet vibrated, but not from footsteps. It was as if the desert itself breathed, stirred, filled with something not of this world.\n— Stand! — roared Ardeshir, leaping to his feet and drawing his sword.\nThe warriors, moments ago relaxed and half-drunk, transformed into beasts of battle. One knocked over a clay jug, spilling dark liquid onto the sand; another grabbed a spear, nearly falling but rising with fury in his eyes.\n— WHAT IS THAT?! — shouted one, trying to drown out the growing chorus of horrific voices.\nBut no one knew.\nThe shadows beyond the camp thickened. The torch flames trembled, as if something invisible swept past.\nAnd then they sensed them.\nNo, they didn’t see—rather, they felt. The jinn of the desert couldn’t be seen by mortal eyes, but their presence was heavy, oppressive, chilling. They didn’t tread on sand or snap branches—but they moved, swirling like whirlwinds, their screams piercing the mind, making hearts clench in fear.\nCold surged over their skin, clammy, as if an unseen hand had brushed them.\n— Form a circle! — bellowed Abu Bakr, tearing his sword from its sheath.\nThe men, casting aside all carelessness, instinctively closed ranks around the fire, back to back, weapons ready.\nThe jinn’s screams grew louder, closer, sharper.\nThe warriors were ready for battle.\nBut how do you fight what cannot be seen?"
    },
     {
        "title": "Chapter 3",
        "content": "The sand was black.\nNot golden, as it had been before, nor soft, as it was on the first day of their journey. No.\nNow it was soaked with blood, mixed with flesh, packed down by bodies that, just a few hours ago, could still be called warriors.\nAbu Bakr stood amidst this carnage, breathing heavily, gripping his saber so tightly that his knuckles turned white. Blood dripped from the blade onto the sand, drop by drop, leaving behind a pattern no one would ever decipher.\nThe world was silent.\nOnly his breathing. Only the dull thud of his heart in his chest.\nCorpses lay everywhere.\nMutilated, hacked apart, twisted into unthinkable poses.\nTheir faces... Oh, those faces. Some frozen in silent screams, others turned into mangled masks of horror, and some without heads at all.\nAbu Bakr struggled to shift his gaze forward.\nWhat had happened? How did it come to this?\nHe remembered the screams.\nHe remembered the darkness sweeping over the camp, invisible hands tearing flesh, his men shouting, striking at the air, fighting an enemy they could not see.\nHe remembered Bahram, clutching his spear, fiercely stabbing at nothingness until something unseen snapped his spine in half, flinging his body into the air like a rag doll.\nHe remembered Ardeshir, whispering prayers until something dark crushed his throat, his words turning into a choked rasp.\nHe remembered himself fighting to the last, his saber finding its mark, his own voice drowning out the cries of his fallen brothers.\nBut then... it all vanished.\nAnd now he was alone.\n— Hey! — his voice echoed across the desert, hoarse, broken. — Where are you?! You wanted us! So take me!\nSilence.\nNo wind, no rustle, no sound.\nAbu Bakr took a step forward, staggering.\nThe sand beneath his feet was soft, as if mixed with something viscous.\nHe looked down.\nBlood. Still warm.\nHe raised his saber again, wiping his brow with a trembling hand.\n— You think you’ve won? — he hissed, staring into the void. — But I’m still alive. And I’m not afraid of you.\nThe shadows around him did not stir.\nAbu Bakr stepped forward.\nAnd then he heard the voice.\nNot a scream, not a whisper, not a howl.\nA voice.\nQuiet. Deep. Insidious.\n— You were not supposed to survive.\nAbu Bakr froze.\nThe voice did not belong to a human.\nIt came from everywhere, seeping into his bones, as if rising from the desert itself.\n— Why do you stand here, among the dead, when your soul should already be gone?\nHe gripped his saber even tighter.\n— I don’t know who you are, — he said slowly, — but if you want to take me, you’ll have to fight.\nSilence.\nAnd then — laughter.\nDeep, resonant, endless.\nLaughter that would chill the blood of any mortal.\nBut Abu Bakr did not flinch.\nHe was ready.\nThe darkness dissipated.\nThe wind, still during the night’s slaughter, suddenly surged, lifting sand and blood into the air. Somewhere far on the horizon, a thin rim of sunlight ignited, slowly piercing through the night’s gloom.\nThe voice spoke no more.\nAbu Bakr stood, breathing heavily, his muscles burning with exhaustion, his mind still struggling to comprehend what had happened. His fingers still clutched the saber’s hilt, but his hands no longer obeyed. They trembled, like those of an old man.\nHe took a step.\nThe ground beneath him felt unsteady, as if the desert itself sought to swallow him along with the other dead.\nAnother step.\nBefore his eyes, shadows flickered, mirages, images of his fallen comrades. He saw Bahram silently screaming, Ardeshir clutching at his throat, a young warrior whose name he hadn’t even remembered reaching toward him with a hand twisted in fear.\nAbu Bakr shook his head, trying to banish the visions.\nBut the voices…\nThey were gone.\nOnly silence.\nAs if the nightmare had dissolved with the first rays of sunlight.\nHe took one last step and collapsed to his knees.\nThe world spun before his eyes. His head pounded, his body ached from wounds, from exertion, from a horror he hadn’t fully grasped until now.\nHe clenched his fists, but his strength was fading.\nThe saber slipped from his hand, falling to the sand with a dull thud.\nHe leaned forward slowly, feeling the earth call to him, exhaustion wrapping him in a heavy shroud.\nHis eyelids closed.\nAnd the desert, so cold at night, suddenly felt warm, as if lulling him to sleep.\nAbu Bakr lost consciousness."
    },
    {
        "title": "Chapter 4",
        "content": "In the grip of ethereal, strange dreams,\nI saw a face dear to my heart.\nHow light glided over her veil,\nHow the wind poured forth her voice.\n— Are you here? Or a desert mirage?\n— I am here, like light, yet unseen.\n— Will you stay? Or will you vanish?\n— I am air… can you hold me?\nI reached out to her gently,\nBut my fingers met only shadow.\nShe laughed, softly, tenderly,\nAnd, like dawn, faded that day.\nAnd now — at the gates of paradise,\nRolling in light, radiant and gleaming.\nYet I do not enter — I fell, I am glad,\nBut my heart will not let the world go.\n— O Lord, I beg, do not call me!\n— I am not ready to abandon my path!\n— The fire of blood still burns within me,\n— I long to clutch my sword to my chest!\nAnd from above, a voice — thunder and echo,\nLike storm and whisper in the silence:\n— You have seen death, passed through ashes,\n— So why do you cling to it still?\n— While that world holds a fire\n— That grants me passion and strength,\n— While there is battle, though it brings pain,\n— While love shines there, like a star,\n— I will not leave, my path is not finished!\n— I have yet to fathom my fate.\n— O, grant me time, grant me nights,\n— To live and love in that world!\nAnd the Gates trembled in an instant,\nA storm roared, ringing out.\nAnd I was falling… softly, bronze-like,\nTo where the sun awaits me.\nI opened my eyes again, at dawn,\nAnd I was Abu Bakr once more."
    },
    {
        "title": "Chapter 5",
        "content": "Abu Bakr opened his eyes.\nThe blazing sun stood high in the sky, blinding him with its merciless light. His lips were parched, his body ached, and his throat felt as though he had been swallowing sand all night.\nThe first thing he saw was a silhouette looming over him.\nA gaunt old man with a long white beard and a sharp, piercing gaze. Dressed in pristine Persian garments, untouched, it seemed, by even a single grain of desert sand.\nThe old man smirked, looking down at him, and slowly shook his head.\n— You must be the most stubborn man in this entire desert. The jinn were already waiting for you on the other side, but it seems even death wants nothing to do with you.\nAbu Bakr tried to move, but his body wouldn’t obey. He groaned, feeling pain shoot through every muscle.\nThe old man crouched beside him and offered a leather waterskin.\n— Drink.\nAbu Bakr struggled to raise his hand and grasped the waterskin. He pressed it to his lips eagerly, but grimaced at once—the water was bitter, laced with the taste of some herbs.\n— What is this filth? — he rasped, spitting it out.\n— Life-giving filth. Drink more, before your pride kills you faster than the jinn.\nAbu Bakr glared at the old man but took a few more sips. The bitterness soon gave way to a pleasant warmth spreading through his body. He felt his strength slowly returning, the pain receding as if dissolving in the strange brew.\nThe old man watched him closely, tilting his head to one side.\n— What’s your name, stubborn one?\nAbu Bakr wiped his lips with the back of his hand.\n— Abu Bakr.\nThe old man gave a faint smile, as if the name meant something to him.\n— Well then, Abu Bakr… Now tell me—why are you still alive?\nThere was no mockery in his voice, only genuine curiosity.\nAbu Bakr sighed heavily and fixed his gaze on the sky.\n— I’d like to understand that myself…"
    },
    {
        "title": "Chapter 6",
        "content": "— Ibn Arabi… — Abu Bakr repeated the old man’s name, savoring it like a rare wine.\nIt sounded familiar. He had heard it before, in the tales of wandering dervishes and merchants crossing the desert. They said Ibn Arabi was not merely a sage, but a man who saw beyond what ordinary mortals could perceive. They said he knew secrets unspoken by books, and that his words could alter destinies.\nAnd now this man sat before him, alive, real, watching him intently, as if reading his thoughts.\n— You said you survived, but you don’t know how, — the old man said, running a hand through his beard, studying him. — Perhaps because your path is not yet finished. Or perhaps because someone very much wants it to remain unfinished.\nAbu Bakr grimaced. He didn’t like riddles. He preferred clarity—either you’re alive, or you’re dead. Everything else was nonsense.\n— I don’t care why I’m alive. What matters is why I’m here.\nHe pulled himself up, sat straighter, and finally said:\n— I came for you, Ibn Arabi. By order of the emir.\nThe old man didn’t flinch.\n— And what does your emir want with me?\n— They didn’t tell me, — Abu Bakr said, rubbing his temples. — I only know I’m to bring you to the palace, whole and unharmed. And that there’s no refusing.\nThe old man sighed.\n— No refusing… — he echoed softly, as if testing the thought. — Amusing. As if a man ever had the right to refuse.\nHe fell silent for a moment, gazing somewhere far off, beyond the sands, beyond the horizon.\n— I knew this day would come.\nHis voice was calm, but there was something in it… weary.\nAbu Bakr couldn’t tell if he liked it or not.\n— So, you’ll come with me?\nIbn Arabi looked him straight in the eyes.\n— I cannot refuse the emir.\nHe said it not with submission, but with a kind of inevitability, as if he already knew all paths led to the same place.\nAbu Bakr nodded.\nHe didn’t know why the emir wanted this old man. He didn’t know why his warriors had to die for this man to be here, alive, or where the bodies of his comrades had vanished while he lay unconscious. But one thing he understood clearly.\nThis journey was only beginning."
    },
    {
        "title": "Chapter 7",
        "content": "The road was long and grueling. The sun scorched their backs all day, and the wind carried sand, burying their tracks as if erasing their existence.\nWhen they reached a small village at the edge of the desert, the sun was nearly gone beyond the horizon. At first, the village seemed long abandoned. The houses were crumbling, roofs caved in, streets empty. Only in the center stood a large, weathered building, with faint light seeping from under its door.\nAbu Bakr moved toward it first, cautiously resting his hand on the hilt of his saber.\n— A dead place, — he muttered, glancing around.\n— And yet it breathes, — Ibn Arabi replied quietly, noticing small shadows flitting behind the window frames.\nAs they drew closer, the door opened, and a man well past middle age stood before them—thin, with deep wrinkles betraying his weariness.\n— Travelers? — he asked, showing neither fear nor hostility.\n— Good evening, indeed we are travelers, — Ibn Arabi confirmed.\nThe man nodded and stepped aside, inviting them in.\nInside, it was unexpectedly warm. Dozens of children’s faces peered at them from the shadows—some with curiosity, others with caution. Some clung to the walls, while others boldly stepped closer.\n— This is an orphanage, — the man explained. — They’re alone. War, disease, hunger… each one has lost their family. Now I am their family.\nAbu Bakr looked around, his usually mocking gaze turning serious.\n— You care for them alone?\n— Who else, if not me?\nThe reply was simple, without bitterness.\nIbn Arabi knelt before a boy of about ten, whose gaunt face looked too old for his years.\n— What’s your name, son?\n— Rashid, — the boy answered, lifting his chin, trying to appear braver than he felt.\n— Rashid, — Ibn Arabi repeated with a gentle smile. — And why aren’t you asleep at this late hour?\n— Because the night here isn’t for sleeping, — the boy said softly.\nIbn Arabi glanced at the man.\n— What does he mean?\nBefore the caretaker could respond, an older girl stepped forward and said:\n— Stay with us tonight. Then you’ll understand.\nAbu Bakr chuckled and crossed his arms.\n— Sounds like a trap. If you’re planning to rob us, know that we’ve got almost nothing with us.\nA few children giggled, but the girl remained serious.\n— It’s not safe outside at night. Better to stay inside.\nAbu Bakr and Ibn Arabi exchanged a glance.\n— Well then, — the warrior said, settling onto one of the rugs. — Let’s see what fears lurk in this place."
    },
    {
        "title": "Chapter 8",
        "content": "The evening was warm, filled with the quiet voices of children and the crackling of old candles. Despite the worn walls and empty shelves, the house didn’t feel impoverished—only steeped in a deep weariness, as if the very air was saturated with others’ memories.\nAbu Bakr quickly found common ground with the children. He sat among them, waving his arms, recounting funny stories of his battles.\n— Picture this: me, alone, against forty of them! They surrounded me like jackals… But I was faster! One swing—and my sword sliced through the air like the wind, straight into an enemy’s helmet! It made a sound like someone dropped a cauldron on stone!\nThe children burst into laughter.\n— Then what?! — a boy shouted, bouncing with excitement.\nAbu Bakr grabbed a piece of flatbread, took a bite, and answered with his mouth full:\n— Then another swing, and there was one less! Then another! And another! By the end of the battle, I was too tired to keep count!\nThe children roared with laughter, clapping their hands. Even the shyest among them gazed at him with admiration.\nMeanwhile, Ibn Arabi sat aside, closely observing the caretaker. They drank tea, seated on the floor, watching the lively scene.\n— Do you often have visitors? — the sage asked gently, wrapping his hands around the warm cup.\nThe caretaker shrugged:\n— Few come here. People avoid this place. They say it’s cursed.\n— And what do you think? Is it cursed?\nThe man gave a faint smile, but there was no mirth in it.\n— A curse is when you know nothing will change. No matter what you do, time devours everything.\nIbn Arabi peered intently into the man’s face. There was something… strange about it. The face looked weary, but the eyes were too… still. As if there was neither soul nor pain behind them.\n— And yet, — he continued, leaning closer, — you stayed here, with the children. Why?\nThe man didn’t answer for a long time, staring into the darkness beyond the window.\n— Because someone has to.\nHis voice sounded too hollow, too even.\nIbn Arabi felt a faint chill run down his spine.\nHe glanced at the caretaker’s hands. The long fingers seemed utterly motionless. Even when he drank his tea, the gesture was mechanical, as if rehearsed.\n— You’ve been through a lot, haven’t you? — the sage said cautiously.\nThe caretaker smiled.\n— Like everyone here.\nBut that smile was not human.\nAt that moment, Abu Bakr let out a loud laugh, tossing one of the younger children into the air.\n— Look how light you are! I could send you soaring like a bird!\nI $@bn Arabi turned his gaze away from the caretaker, but the feeling that something was wrong lingered.\nThere was something about this man… something that wasn’t as it should be.\nAnd the night had not yet fallen."
    }
]
